[
  {
    "title": "India reports 1,033 new COVID-19 cases in last 24 hours",
    "description": "India reported 1,033 new COVID -19 cases in the last 24 hours, the Ministry of Health and Family Welfare informed on Thursday.",
    "content": "India reported 1,033 new COVID -19 cases in the last 24 hours, the Ministry of Health and Family Welfare informed on Thursday. With the new cases, the active caseload stands at 11,639 which accounts for 0.03 per cent of the country's total positive c... [550 chars]",
    "url": "https://www.devdiscourse.com/article/law-order/1993880-india-reports-1033-new-covid-19-cases-in-last-24-hours",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/07_04_2022_04_21_13_0685266.png?width=920&format=jpeg",
    "publishedAt": "2022-04-07T04:21:14Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
    "title": "'No present evidence suggests presence of XE variant of COVID-19 in India: Health Ministry",
    "description": "XE Variant of Covid 19 The ministry said the individual who had tested positive for XE Variant is a fully vaccinated 50 year old woman with no comorbidity and asymptomatic",
    "content": "New Delhi | Jagran News Desk: The Union Health Ministry on Wednesday said that the present evidence does not suggest the presence of the XE variant of COVID denying media reports that claimed that a case of the new mutant was reported in Mumbai.\n“Hou... [2059 chars]",
    "url": "https://english.jagran.com/india/no-present-evidence-suggest-presence-of-xe-variant-of-covid19-in-india-health-ministry-10041727",
    "image": "https://imgeng.jagran.com/images/2022/apr/xe1649299618105.jpg",
    "publishedAt": "2022-04-07T02:43:23Z",
    "source": {
      "name": "Jagran English",
      "url": "https://english.jagran.com"
    }
  },
  {
    "title": "COVID-19 increases risk of blood clots for up to six months, even in mild cases, says study",
    "description": "Previous research has indicated that Covid raises the risk of blood clots, but the new study in the BMJ medical journal shows how long the threat can linger",
    "content": "Paris: People who have had Covid-19 have an increased risk of developing serious blood clots for up to six months after getting infected, even in mild cases, a study said Thursday.\nPrevious research has indicated that Covid raises the risk of blood c... [1699 chars]",
    "url": "https://www.firstpost.com/health/covid-19-increases-risk-of-blood-clots-for-up-to-six-months-even-in-mild-cases-says-study-10526101.html",
    "image": "https://images.firstpost.com/wp-content/uploads/2021/07/covid-shutterstock.jpg",
    "publishedAt": "2022-04-07T02:33:43Z",
    "source": {
      "name": "Firstpost",
      "url": "https://www.firstpost.com"
    }
  },
  {
    "title": "India reports 1,033 new COVID pandemic cases with 43 fatalities in single day",
    "description": "COVID cases today, India COVID infections, COVID-19 cases, India COVID, active infections, COVID-19, Coronavirus, COVID-19 caseload, COVID-19 cases today, COVID cases, COVID-19, Coronavirus, COVID-19 caseload, COVID-19 cases today, COVID cases, india covid cases, Covid-19 tests, Covid-19 recovery ra",
    "content": "Follow us on Image Source : PTI. A medic administers a dose of Covid-19 vaccine to a beneficiary at Nair Hospital, in Mumbai, Wednesday, April 06, 2022. First case of new Covid-19 variant called XE has been detected in Mumbai.\nHighlights Total active... [3741 chars]",
    "url": "https://www.indiatvnews.com/news/india/coronavirus-pandemic-covid-death-toll-positivity-rate-vaccination-fatalities-omicron-covid-data-latest-covid-news-updates-2022-04-07-768215",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/covid-vaccine-pti-1649301418.jpg",
    "publishedAt": "2022-04-07T04:16:33Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "US Cautions its Citizens",
    "description": "Reconsider travel to Sri Lanka due to Covid-19 and fuel and medicine shortages. Exercise increased caution in Sri Lanka due to terrorism, State Department said in its latest travel advisory which has now been placed on Level 3",
    "content": "Amid the ongoing unrest in Sri Lanka owing to its economic crisis, the United States on Wednesday advised its citizens against travelling to the island nation, pointing to the fuel and medicine shortages there, besides the Covid-19 and terror threats... [1937 chars]",
    "url": "https://www.news18.com/news/world/reconsider-travel-to-sri-lanka-due-to-fuel-medicine-shortages-and-covid-us-cautions-its-citizens-4949564.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/04/pjimage-59-164930442216x9.jpg",
    "publishedAt": "2022-04-07T04:07:36Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Number of Indian students in US rose by 12%, from China dropped by 8%",
    "description": "In its annual report, US Citizenship and Immigration Services said the COVID-19 pandemic continued to impact international student enrolment in the United States in 2021",
    "content": "In its annual report, US Citizenship and Immigration Services said the COVID-19 pandemic continued to impact international student enrolment in the United States in 2021\nWashington: The number of Indian students in the United States increased by over... [3915 chars]",
    "url": "https://www.firstpost.com/world/number-of-indian-students-in-us-rose-by-12-from-china-dropped-by-8-10526171.html",
    "image": "https://images.firstpost.com/wp-content/uploads/2021/08/students-31.jpg",
    "publishedAt": "2022-04-07T02:52:37Z",
    "source": {
      "name": "Firstpost",
      "url": "https://www.firstpost.com"
    }
  },
  {
    "title": "Fan wants Sonu Sood to distribute chilled beer this summer, actor asks if he'd like 'bhujia' too",
    "description": "Bollywood actor Sonu Sood helped many people over past two years since the Covid-19 pandemic hit the country. But recently one of his fans had a funny request from him as he asked him to get some chilled beer in the summers. Sonu's hilarious response has left netizens impressed. Take a look!",
    "content": "Follow us on Image Source : INSTAGRAM/SONU SOOD Sonu Sood\nHighlights Sonu Sood has been at the forefront of philanthropist activities during COVID-19\nSonu and his team also helped students cross borders in the war-torn Ukraine\nHis fan shared a meme a... [2025 chars]",
    "url": "https://www.indiatvnews.com/entertainment/celebrities/fan-asks-sonu-sood-distribute-chilled-beer-summer-actor-funny-reply-if-he-want-bhujia-latest-celeb-news-2022-04-07-768208",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/pjimage-2022-04-07t081419-1649299464.jpg",
    "publishedAt": "2022-04-07T02:45:54Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  
  
  {
    "title": "Boeing 737 MAX jet resumes China journey amid uncertainty over model's return",
    "description": "Boeing declined to comment on the flight but said it continued to work with customers and global regulators to return the MAX to service. The flight to Shanghai, which is in the middle of a strict COVID-19 related lockdown, comes as Chinese authorities scrutinise China Eastern's safety processes following the crash of a 737-800 on March 21 that killed all 132 people on board.",
    "content": "A Boeing Co 737 MAX meant for China Eastern Airlines subsidiary Shanghai Airlines is flying from Guam to Shanghai on Thursday, flight tracking websites showed, amid uncertainty over when the model will resume flying in China. Flight BOE631 comes more... [2036 chars]",
    "url": "https://www.devdiscourse.com/article/business/1993814-boeing-737-max-jet-resumes-china-journey-amid-uncertainty-over-models-return",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_37_32_7527733.png?width=920&format=jpeg",
    "publishedAt": "2022-04-07T00:27:11Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
    "title": "Boeing 737 MAX jet to resume China journey amid uncertainty over model's return",
    "description": "Boeing did not respond immediately to a request for comment. The planned flight to Shanghai, which is in the middle of a strict COVID-19 related lockdown, comes as Chinese authorities scrutinise China Eastern's safety processes following the crash of a 737-800 on March 21 that killed all 132 people on board.",
    "content": "A Boeing Co 737 MAX meant for China Eastern Airlines subsidiary Shanghai Airlines is due to fly from Guam to Shanghai on Thursday, flight tracking websites showed, amid uncertainty over when the model will resume flying in China. The planned flight B... [1886 chars]",
    "url": "https://www.devdiscourse.com/article/business/1993801-boeing-737-max-jet-to-resume-china-journey-amid-uncertainty-over-models-return",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_37_21_0109025.png?width=920&format=jpeg",
    "publishedAt": "2022-04-06T23:12:46Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
    "title": "Delhi tracking those who stopped classes due to Covid-19: Sisodia",
    "description": "Speaking with The Indian Express’s national education editor Ritika Chopra at the India Education Summit, Sisodia said that as of now around 1,700 such students have been brought back into the system.",
    "content": "The Delhi government is in the process of tracking students who had stopped attending school after the pandemic and is working on ways to bring them back into the system, Delhi Education Minister Manish Sisodia said.\nSpeaking with The Indian Express’... [1596 chars]",
    "url": "https://indianexpress.com/article/cities/delhi/delhi-tracking-those-who-stopped-classes-due-to-covid-19-sisodia-7857061/",
    "image": "https://images.indianexpress.com/2022/04/sisodia-3col.jpg",
    "publishedAt": "2022-04-06T22:35:15Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  }
]