[
  {
"title": "When Lady Gaga aced the headstand, set massive fitness goals (see picture inside)",
"description": "Rollin’ into Monday like…🤟, Gaga, dressed in a pair of blue tights and a tie-dye top, captioned her Instagram post",
"content": "Oscar-winning American singer-songwriter Lady Gaga recently gave her fans and followers a glimpse of her workout. In the picture, Gaga, 35, could be seen acing a headstand with ease. “Rollin’ into Monday like…🤟,” Gaga, dressed in a pair of blue tight... [1811 chars]",
"url": "https://indianexpress.com/article/lifestyle/fitness/lady-gaga-fitness-headstand-benefits-7750875/",
"image": "https://images.indianexpress.com/2022/02/lady-gaga_1200_insta.jpg",
"publishedAt": "2022-04-11T03:40:12Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
{
"title": "Your 'Health Programme' is Fatphobic",
"description": "Ensuring the fitness of your employees is great, but there are better ways to do it. Zerodha founder Nitin Kamath's 'initiative' is beyond unscientific.",
"content": "Zerodha founder and CEO Nithin Kamath announced that his company was running a ‘health programme’ that would give half a month’s bonus to those who had a body mass index of below 25. He went on to add that the average BMI of his team was 25.3 and if ... [3969 chars]",
"url": "https://theprint.in/opinion/pov/a-message-for-zerodha-founder-nithin-kamath-your-health-programme-is-fatphobic/908327/",
"image": "https://static.theprint.in/wp-content/uploads/2022/04/Nithin-Kamath-2.jpg",
"publishedAt": "2022-04-09T05:11:39Z",
"source": {
"name": "ThePrint",
"url": "https://theprint.in"
}
},
  {
"title": "‘Good physique’: When ‘Terminator’ Arnold Schwarzenegger was impressed with THIS Mr India's fitness",
"description": "In 2014, when Malayalam actor Abu Salim was in the audio launch function of one of his movies 'I' little did he know that he would create a memory tha",
"content": "When you impress the real life 'Terminator' Arnold Schwarzenegger, the moment when he had patted you saying 'good physique' can never get old; even if it was 8 years before.In 2014, when Malayalam actor Abu Salim was in the audio launch function of o... [1854 chars]",
"url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/good-physique-when-terminator-arnold-schwarzenegger-was-impressed-with-this-mr-indias-fitness/articleshow/90710268.cms",
"image": "https://static.toiimg.com/thumb/msid-90710212,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1325587/90710212.jpg",
"publishedAt": "2022-04-07T13:10:00Z",
"source": {
"name": "Times of India",
"url": "https://timesofindia.indiatimes.com"
}
},
  {
    "title": "One of the best pre-workout fruits for diabetics is…",
    "description": "\"Do not combine it with meals. Try to eat the whole fruit, not juice, and don’t add fruits to a vegetable salad because fructose eaten with veggies will delay digestion and bloat you up,\" said Dr Ria Banerjee Ankola",
    "content": "Owing to its many health benefits and the instant boost of energy it provides, many people swear by a banana as their pre-workout snack. But, it is not considered to be the best fruit for diabetics as it has a higher fructose content that can lead to... [2147 chars]",
    "url": "https://indianexpress.com/article/lifestyle/health/diabetics-fruits-banana-pre-workout-fruit-watermelon-7853752/",
    "image": "https://images.indianexpress.com/2022/02/GettyImages-body-weight-fat-exercise-1200-1.jpg",
    "publishedAt": "2022-04-06T11:30:35Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
"title": "Exercise can lower risk of getting bowel cancer: Study",
"description": "Exercise can lower your risk of getting bowel cancer and slow the growth of tumours, according to a recent study.",
"content": "Exercise can lower your risk of getting bowel cancer and slow the growth of tumours, according to a recent study. The research was published in the journal, 'International Journal of Cancer'. It has been shown that physical activity causes the cancer... [3981 chars]",
"url": "https://www.devdiscourse.com/article/health/1998164-exercise-can-lower-risk-of-getting-bowel-cancer-study",
"image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_04_2022_10_32_08_8009327.jpg?width=920&format=jpeg",
"publishedAt": "2022-04-10T10:32:30Z",
"source": {
"name": "Devdiscourse",
"url": "https://www.devdiscourse.com"
}
},
{
"title": "Sitting Tai Chi exercise improves recovery outcomes for older stroke survivors: Study",
"description": "A new study has found that stroke survivors who practised a seated form of Tai Chi had equal or greater improvement in hand and arm strength, shoulder range of motion, balance control, symptoms of depression and activities of daily living after three months, compared to those who participated in a standard stroke rehabilitation exercise program.",
"content": "A new study has found that stroke survivors who practised a seated form of Tai Chi had equal or greater improvement in hand and arm strength, shoulder range of motion, balance control, symptoms of depression and activities of daily living after three... [4558 chars]",
"url": "https://www.devdiscourse.com/article/health/1997569-sitting-tai-chi-exercise-improves-recovery-outcomes-for-older-stroke-survivors-study",
"image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/09_04_2022_15_43_46_7874802.jpg?width=920&format=jpeg",
"publishedAt": "2022-04-09T15:44:08Z",
"source": {
"name": "Devdiscourse",
"url": "https://www.devdiscourse.com"
}
},
  {
    "title": "Study details how exercise reduces depression",
    "description": "Regular exercise is a wonderful tool for overcoming depression .According to a new study led by researchers at the Iowa State University, exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify the benefits of therapy.",
    "content": "Regular exercise is a wonderful tool for overcoming depression. According to a new study led by researchers at the Iowa State University, exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify t... [4947 chars]",
    "url": "https://www.devdiscourse.com/article/lifestyle/1988452-study-details-how-exercise-reduces-depression",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_04_2022_05_40_04_1934953.jpg?width=920&format=jpeg",
    "publishedAt": "2022-04-03T05:40:05Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
"title": "Is 30 minutes of exercise a day enough?",
"description": "Can we get by with less? Do we have to exercise all in one session, or can we spread it throughout the day? And when we’re talking about exercise, does it have to be hard to count?",
"content": "For anyone interested in the relationship between exercise and living longer, one of the most pressing questions is how much we really need to stay healthy. Is 30 minutes a day enough? Can we get by with less? Do we have to exercise all in one sessio... [5680 chars]",
"url": "https://indianexpress.com/article/lifestyle/fitness/is-30-minutes-of-exercise-a-day-enough-7860053/",
"image": "https://images.indianexpress.com/2022/04/pexels-andrea-piacquadio-3767517.jpg",
"publishedAt": "2022-04-08T17:00:28Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
  {
    "title": "Twist your Workout with These Advance Level Push-Ups",
    "description": "People who follow an intense workout regime follow attempt more than 300 pushups a day",
    "content": "Every fitness enthusiast across the globe is well aware that a proper workout session is incomplete if it doesn’t include bouts of push-ups. And why not? After all the traditional style push-ups are extremely beneficial in building your upper body st... [1909 chars]",
    "url": "https://www.news18.com/news/lifestyle/twist-your-workout-with-these-advance-level-push-ups-4933217.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/04/push-ups-workout-164889494116x9.jpg",
    "publishedAt": "2022-04-02T14:30:12Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Fitness watch: You don’t necessarily need to feel sore in the hours or days after exercise",
    "description": "Delayed onset muscle soreness is the scientific term to describe the sore and tender feeling our muscles have after a workout",
    "content": "“No pain, no gain” is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you’ve done enough.\nThere are many reasons why your muscles might get sore... [4508 chars]",
    "url": "https://scroll.in/field/1020883/fitness-watch-you-dont-necessarily-need-to-feel-sore-in-the-hours-or-days-after-exercise",
    "image": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/151335-xifgbkerka-1606724146.jpg",
    "publishedAt": "2022-04-02T10:30:00Z",
    "source": {
      "name": "Scroll.in",
      "url": "https://scroll.in"
    }
  }
]