[
  {
    "title": "Raising mercury! Guess the price of Disha Patani's spaghetti strap dress",
    "description": "While Disha herself is a big fan of fitness, which means her closet is full of athleisure clothing, she is also a lot into dresses, especially hot dre",
    "content": "She is one of the hottest actresses in Bollywood and besides setting fitness goals on a daily basis, Disha Patani keeps on dropping style inspo for her fans, every now and then. While Disha herself is a big fan of fitness, which means her closet is f... [1298 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/fashion/celeb-style/raising-mercury-guess-the-price-of-disha-patanis-spaghetti-strap-dress/articleshow/90649889.cms",
    "image": "https://static.toiimg.com/thumb/msid-90649889,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-69564/90649889.jpg",
    "publishedAt": "2022-04-05T04:30:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  {
    "title": "I’d scan my brain if I wake up as Ronaldo: Kohli",
    "description": "A big fan of Ronaldo's work ethics and fitness regime, Kohli expressed his admiration for the star footballer during a photoshoot for his IPL franchise Royal Challengers Bangalore.",
    "content": "A huge fan of Cristiano Ronaldo, star India batter Virat Kohli says he would do a scan of his brain if he wakes up one day as the Portuguese football icon.\nA big fan of Ronaldo’s work ethics and fitness regime, Kohli expressed his admiration for the ... [1712 chars]",
    "url": "https://indianexpress.com/article/sports/cricket/id-scan-my-brain-if-i-wake-up-as-ronaldo-kohli-7852792/",
    "image": "https://images.indianexpress.com/2022/04/virat-kohli-cristiano-ronaldo.jpg",
    "publishedAt": "2022-04-04T14:53:54Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Apple Fitness Plus Now Includes Post-Childbirth Exercise Routines",
    "description": "The program includes mindfulness for parents.",
    "content": "> fitness\nAfter giving birth, postpartum exercise is something that should be navigated consciously and safely. Apple Fitness Plus is stepping in with a new workout program tailored to this period, called 'Get Back to Fitness After Having a Baby'.\nAp... [1009 chars]",
    "url": "https://in.mashable.com/fitness/29694/apple-fitness-plus-now-includes-post-childbirth-exercise-routines",
    "image": "https://sm.mashable.com/t/mashable_in/article/a/apple-fitn/apple-fitness-plus-now-includes-post-childbirth-exercise-rou_q7ww.1200.jpg",
    "publishedAt": "2022-04-04T05:38:07Z",
    "source": {
      "name": "Mashable India",
      "url": "https://in.mashable.com"
    }
  },
  {
    "title": "Demotivated to workout? Here’s one science-approved way to get moving again",
    "description": "A study found that using fitness apps increased everyday physical activity by an equivalent of 1,235 steps, and moderate and vigorous physical activity by 48.5 minutes a week",
    "content": "Fitness trackers and monitors were all the rage when they were newly launched in India. Everyone wanted one, no matter how often they worked out. But for fitness enthusiasts, it remains a daily necessity for monitoring their workouts, calories burned... [2673 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/demotivated-to-workout-heres-one-science-approved-way-to-get-moving-again-7844496/",
    "image": "https://images.indianexpress.com/2022/03/fitness-tracker.jpg",
    "publishedAt": "2022-04-03T04:51:31Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Badshah admits being clinically depressed, reveals suffering from anxiety & sleep apnea",
    "description": "Badshah said that to maintain his mental health, one has to be selfish. 'Mental fitness is my priority in life. Mental peace is a luxury for me because of the pressure that we face every day. I have been through the darkest times when it comes to my mental health.'",
    "content": "Follow us on Image Source : INSTAGRAM/BADSHAH Badshah\nAfter India's Got Talent 9, Shilpa Shetty and Badshah have reunited for the former's talk show, 'Shape of You'. In a candid conversation, the singer-musician opened up about his mental health jour... [2015 chars]",
    "url": "https://www.indiatvnews.com/entertainment/celebrities/badshah-admits-being-clinically-depressed-reveals-suffering-from-anxiety-sleep-apnea-2022-04-02-767281",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/pjimage-4-1648901414.jpg",
    "publishedAt": "2022-04-02T12:22:59Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Fitness watch: You don’t necessarily need to feel sore in the hours or days after exercise",
    "description": "Delayed onset muscle soreness is the scientific term to describe the sore and tender feeling our muscles have after a workout",
    "content": "“No pain, no gain” is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you’ve done enough.\nThere are many reasons why your muscles might get sore... [4508 chars]",
    "url": "https://scroll.in/field/1020883/fitness-watch-you-dont-necessarily-need-to-feel-sore-in-the-hours-or-days-after-exercise",
    "image": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/151335-xifgbkerka-1606724146.jpg",
    "publishedAt": "2022-04-02T10:30:00Z",
    "source": {
      "name": "Scroll.in",
      "url": "https://scroll.in"
    }
  },
  {
    "title": "From mental well-being to core fitness, best yoga poses for elderly people",
    "description": "Yoga can also help to reduce any form of stress, depression, anxiety, and other mental health-related issues. You can practice Surya Namaskar, yoga mudras, pranayama, and meditation along with physical postures. it helps you to preserve memory and even improve concentration and focus.",
    "content": "Follow us on Image Source : FREEPIK Best yoga poses for elderly people\nYoga should be started as early as possible but it also is never too late to begin your practice. Making it a part of your routine can help you age gracefully. Not only does yoga ... [2638 chars]",
    "url": "https://www.indiatvnews.com/health/from-mental-well-being-to-core-fitness-best-yoga-poses-for-elderly-people-2022-04-01-767083",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/yoga-poses-1648797311.jpg",
    "publishedAt": "2022-04-01T07:15:26Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "‘You can lose weight even while staying at home’: Shehnaaz Gill opens up about diet, fitness and mental health",
    "description": "\"It wasn't like I did something different in my diet. I consumed the same diet but reduced my portion size,\" she revealed",
    "content": "Shehnaaz Gill, who rose to fame following her stint in the reality show Bigg Boss, has left everyone in awe of her candid nature and impeccable style. Post the show, she stunned her fans with a massive weight-loss transformation that she achieved dur... [2823 chars]",
    "url": "https://indianexpress.com/article/lifestyle/life-style/shehnaaz-gill-diet-fitness-weight-loss-mental-health-7837555/",
    "image": "https://images.indianexpress.com/2022/03/Shehnaaz-1200.jpg",
    "publishedAt": "2022-03-31T11:30:47Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Garmin Fenix 7X Sapphire Solar review: Heavy on fitness, but how smart is it?",
    "description": "Here's our full review of the Garmin Fenix 7X Sapphire Solar, a premium fitness-oriented smartwatch that also has a solar ring for charging.",
    "content": "Garmin’s Fenix smartwatches have always been premium wearables catering to the more fitness-oriented users. The Fenix 7 series is no exception and targeted at hardcore fitness enthusiasts, who not only want to monitor a lot of data, but also need som... [6583 chars]",
    "url": "https://indianexpress.com/article/technology/tech-reviews/garmin-fenix-7x-sapphire-solar-review-7846197/",
    "image": "https://images.indianexpress.com/2022/03/Garmin-Fenix-7X-Solar-Sapphire-review-1.jpg",
    "publishedAt": "2022-03-31T09:30:03Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "When most looked the other way, a good samaritan risked his life - and died",
    "description": "Late on Tuesday, 38-year-old Satish, a fitness trainer who became an e-rickshaw driver after losing his job during the lockdown, died while attempting in vain to save two workers and their contractor from a sewer in outer Delhi.",
    "content": "THE HERO who once saved two children from drowning in a lake rescues three men from a toxic sewer.\nIf all had gone well, this was how the world would have hailed Satish Singh. But then, all didn’t go well.\nLate on Tuesday, 38-year-old Satish, a fitne... [4516 chars]",
    "url": "https://indianexpress.com/article/cities/delhi/when-most-looked-the-other-way-a-good-samaritan-risked-his-life-and-died-7845195/",
    "image": "https://images.indianexpress.com/2022/03/Satish-Singh.jpg",
    "publishedAt": "2022-03-30T22:30:36Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  }
]