[
  {
    "title": "Fitness tips: Here are some benefits of cooling down after a workout",
    "description": "“Do you cool down after a workout? If not, you are exposing yourself to the danger of an injury, both physical and internal,” fitness expert Nidhi S captioned her post.",
    "content": "If you indulge in regular physical activity, you may know the importance of a cooling-down period post a workout session. For the uninitiated, a cooling down period after any kind of strenuous exercise is referred to as a series of gentle stretching ... [1916 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/benefits-cooling-down-workout-exercise-7833241/",
    "image": "https://images.indianexpress.com/2022/04/Fitness-cooling-down.jpg",
    "publishedAt": "2022-04-09T03:40:48Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Muscle Soreness is a Poor Measure of Workout Efficiency, Here’s Why",
    "description": "When the muscles get sore, the pain is compensated by the belief that it was a good workout.",
    "content": "Almost all gym-goers must have come across t-shirts exclaiming ‘No Pain, No Gain.’ Even posters feature the proverb in bold and bulky letters to ingrain the thought deep into your brain. You read the proverb, eat it as a motto, and start pumping thos... [1713 chars]",
    "url": "https://www.news18.com/news/lifestyle/muscle-soreness-is-a-poor-measure-of-workout-efficiency-heres-why-4952618.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/03/gym-164812483616x9.png",
    "publishedAt": "2022-04-08T05:00:26Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
"title": "A look inside Portl’s AI smart mirrors powering personal fitness journeys",
"description": "We strive to be ISO 27701, GDPR compliant, and HIPAA compliant.",
"content": "Launched in March 2021, Hyderabad-based Portl designs and manufactures proprietary smart mirrors that work as a personalised and on-demand fitness trainer and digital health and wellness companion. Their flagship product Portl Studio comes with a 43′... [5285 chars]",
"url": "https://analyticsindiamag.com/a-look-inside-portls-ai-smart-mirrors-powering-personal-fitness-journeys/",
"image": "https://149695847.v2.pressablecdn.com/wp-content/uploads/2022/04/Cropped-1602668362-1300x731.png",
"publishedAt": "2022-04-09T04:30:00Z",
"source": {
"name": "Analytics India Magazine",
"url": "https://analyticsindiamag.com"
}
},
  {
    "title": "One of the best pre-workout fruits for diabetics is…",
    "description": "\"Do not combine it with meals. Try to eat the whole fruit, not juice, and don’t add fruits to a vegetable salad because fructose eaten with veggies will delay digestion and bloat you up,\" said Dr Ria Banerjee Ankola",
    "content": "Owing to its many health benefits and the instant boost of energy it provides, many people swear by a banana as their pre-workout snack. But, it is not considered to be the best fruit for diabetics as it has a higher fructose content that can lead to... [2147 chars]",
    "url": "https://indianexpress.com/article/lifestyle/health/diabetics-fruits-banana-pre-workout-fruit-watermelon-7853752/",
    "image": "https://images.indianexpress.com/2022/02/GettyImages-body-weight-fat-exercise-1200-1.jpg",
    "publishedAt": "2022-04-06T11:30:35Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
"title": "World Health Day: Go desi for long-term fitness and wellness",
"description": "With markets flooded with 'healthy' foods and a long list of experts suggesting a new recipe daily on social and digital media platforms, choosing the right food can be a nightmare for consumers. Almost every other patient I consult asks me the same question: What should I eat to ensure long-term fitness and wellness? The question particularly stresses 'long-term', which has",
"content": "With markets flooded with 'healthy' foods and a long list of experts suggesting a new recipe daily on social and digital media platforms, choosing the right food can be a nightmare for consumers. Almost every other patient I consult asks me the same ... [4161 chars]",
"url": "https://www.deccanherald.com/opinion/world-health-day-go-desi-for-long-term-fitness-and-wellness-1098453.html",
"image": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/04/07/bowl-dish-with-brown-rice-cucumber-tomato-green-peas-red-cabbage-chickpea-fresh-lettuce-salad-and-cashew-nuts-healthy-balanced-eating-1-1026127.jpg",
"publishedAt": "2022-04-07T14:35:27Z",
"source": {
"name": "Deccan Herald",
"url": "https://www.deccanherald.com"
}
},
  {
    "title": "Five skincare hacks to ‘prevent breakouts from your workouts’",
    "description": "The sweat released during the workout can lead to skin issues like acne breakouts, irritation, redness and rashes",
    "content": "Physical activities are known to be beneficial for the skin, and help it give a natural and healthy glow. The sweat released during workouts, however, can also lead to skin issues like acne breakouts, irritation, redness and rashes. So, to reap the m... [1215 chars]",
    "url": "https://indianexpress.com/article/lifestyle/five-skincare-hacks-to-prevent-breakouts-from-your-workouts-7806794/",
    "image": "https://images.indianexpress.com/2022/03/workout-skincare-1200.jpg",
    "publishedAt": "2022-04-06T06:00:05Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Study details how exercise reduces depression",
    "description": "Regular exercise is a wonderful tool for overcoming depression .According to a new study led by researchers at the Iowa State University, exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify the benefits of therapy.",
    "content": "Regular exercise is a wonderful tool for overcoming depression. According to a new study led by researchers at the Iowa State University, exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify t... [4947 chars]",
    "url": "https://www.devdiscourse.com/article/lifestyle/1988452-study-details-how-exercise-reduces-depression",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_04_2022_05_40_04_1934953.jpg?width=920&format=jpeg",
    "publishedAt": "2022-04-03T05:40:05Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
"title": "World Health Day: Emraan Hashmi to Richa Chadha, B-Towners Who Underwent Fitness Transformation Recently",
"description": "Emraan Hashmi, Rajkummar Rao and Richa Chadha are among Bollywood celebs who recently underwent major body transformations.",
"content": "April 7th is celebrated as World Health Day all around the world. This special day is to create global health awareness by the World Health Organisation. When it comes to health and fitness, celebs never fail to motivate their fans to take up a healt... [2853 chars]",
"url": "https://www.news18.com/news/lifestyle/world-health-day-emraan-hashmi-to-richa-chadha-b-towners-who-underwent-fitness-transformation-recently-4951820.html",
"image": "https://images.news18.com/ibnlive/uploads/2022/04/emraan-richa-164933160016x9.jpg",
"publishedAt": "2022-04-07T11:41:19Z",
"source": {
"name": "News18",
"url": "https://www.news18.com"
}
},
  {
"title": "World Health Day 2022: Rachi Sharma, Riya Bhattacharje and Akanksha Juneja share their fitness mantra; urge people to stay healthy",
"description": "World Health Day, which is celebrated on April 7, is a day to spread awareness regarding physical and mental health. On this day, our television stars",
"content": "Read Also World Health Day, which is celebrated on April 7, is a day to spread awareness regarding physical and mental health. The theme for World Health Day 2022 is 'Our Planet, Our Health.' On this day, our television stars have urged people to sta... [2035 chars]",
"url": "https://timesofindia.indiatimes.com/tv/news/hindi/world-health-day-2022-rachi-sharma-riya-bhattacharje-and-akanksha-juneja-share-their-fitness-mantra-urge-people-to-stay-healthy/articleshow/90704991.cms",
"image": "https://static.toiimg.com/thumb/msid-90704977,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-54960/90704977.jpg",
"publishedAt": "2022-04-07T09:30:00Z",
"source": {
"name": "Times of India",
"url": "https://timesofindia.indiatimes.com"
}
},
  {
"title": "World Health Day 2022 | Bollywood divas Richa Chadha, Jacqueline Fernandez and Rakul Preet share fitness journeys",
"description": "Bollywood divas Richa Chadha Jacqueline Fernandez and Rakul Preet opened up about the importance of good health on the occasion of World Health Day 2022 Read here to know what they said",
"content": "New Delhi | Jagran Lifestyle Desk: Every year on April 7, people across the globe observe World Health Day with an aim to create awareness about the importance of health. This year, people are celebrating 72nd year of World Health Day, and the theme ... [3218 chars]",
"url": "https://english.jagran.com/lifestyle/world-health-day-2022-bollywood-divas-richa-chadha-jacqueline-fernandez-and-rakul-preet-share-fitness-journeys-10041742",
"image": "https://imgeng.jagran.com/images/2022/apr/rkr1649316418442.jpg",
"publishedAt": "2022-04-07T07:19:36Z",
"source": {
"name": "Jagran English",
"url": "https://english.jagran.com"
}
}
]