[
  {
    "title": "Badshah admits being clinically depressed, reveals suffering from anxiety & sleep apnea",
    "description": "Badshah said that to maintain his mental health, one has to be selfish. 'Mental fitness is my priority in life. Mental peace is a luxury for me because of the pressure that we face every day. I have been through the darkest times when it comes to my mental health.'",
    "content": "Follow us on Image Source : INSTAGRAM/BADSHAH Badshah\nAfter India's Got Talent 9, Shilpa Shetty and Badshah have reunited for the former's talk show, 'Shape of You'. In a candid conversation, the singer-musician opened up about his mental health jour... [2015 chars]",
    "url": "https://www.indiatvnews.com/entertainment/celebrities/badshah-admits-being-clinically-depressed-reveals-suffering-from-anxiety-sleep-apnea-2022-04-02-767281",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/pjimage-4-1648901414.jpg",
    "publishedAt": "2022-04-02T12:22:59Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Fitness watch: You don’t necessarily need to feel sore in the hours or days after exercise",
    "description": "Delayed onset muscle soreness is the scientific term to describe the sore and tender feeling our muscles have after a workout",
    "content": "“No pain, no gain” is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you’ve done enough.\nThere are many reasons why your muscles might get sore... [4508 chars]",
    "url": "https://scroll.in/field/1020883/fitness-watch-you-dont-necessarily-need-to-feel-sore-in-the-hours-or-days-after-exercise",
    "image": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/151335-xifgbkerka-1606724146.jpg",
    "publishedAt": "2022-04-02T10:30:00Z",
    "source": {
      "name": "Scroll.in",
      "url": "https://scroll.in"
    }
  },
  {
    "title": "From mental well-being to core fitness, best yoga poses for elderly people",
    "description": "Yoga can also help to reduce any form of stress, depression, anxiety, and other mental health-related issues. You can practice Surya Namaskar, yoga mudras, pranayama, and meditation along with physical postures. it helps you to preserve memory and even improve concentration and focus.",
    "content": "Follow us on Image Source : FREEPIK Best yoga poses for elderly people\nYoga should be started as early as possible but it also is never too late to begin your practice. Making it a part of your routine can help you age gracefully. Not only does yoga ... [2638 chars]",
    "url": "https://www.indiatvnews.com/health/from-mental-well-being-to-core-fitness-best-yoga-poses-for-elderly-people-2022-04-01-767083",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/yoga-poses-1648797311.jpg",
    "publishedAt": "2022-04-01T07:15:26Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "‘You can lose weight even while staying at home’: Shehnaaz Gill opens up about diet, fitness and mental health",
    "description": "\"It wasn't like I did something different in my diet. I consumed the same diet but reduced my portion size,\" she revealed",
    "content": "Shehnaaz Gill, who rose to fame following her stint in the reality show Bigg Boss, has left everyone in awe of her candid nature and impeccable style. Post the show, she stunned her fans with a massive weight-loss transformation that she achieved dur... [2823 chars]",
    "url": "https://indianexpress.com/article/lifestyle/life-style/shehnaaz-gill-diet-fitness-weight-loss-mental-health-7837555/",
    "image": "https://images.indianexpress.com/2022/03/Shehnaaz-1200.jpg",
    "publishedAt": "2022-03-31T11:30:47Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Garmin Fenix 7X Sapphire Solar review: Heavy on fitness, but how smart is it?",
    "description": "Here's our full review of the Garmin Fenix 7X Sapphire Solar, a premium fitness-oriented smartwatch that also has a solar ring for charging.",
    "content": "Garmin’s Fenix smartwatches have always been premium wearables catering to the more fitness-oriented users. The Fenix 7 series is no exception and targeted at hardcore fitness enthusiasts, who not only want to monitor a lot of data, but also need som... [6583 chars]",
    "url": "https://indianexpress.com/article/technology/tech-reviews/garmin-fenix-7x-sapphire-solar-review-7846197/",
    "image": "https://images.indianexpress.com/2022/03/Garmin-Fenix-7X-Solar-Sapphire-review-1.jpg",
    "publishedAt": "2022-03-31T09:30:03Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "When most looked the other way, a good samaritan risked his life - and died",
    "description": "Late on Tuesday, 38-year-old Satish, a fitness trainer who became an e-rickshaw driver after losing his job during the lockdown, died while attempting in vain to save two workers and their contractor from a sewer in outer Delhi.",
    "content": "THE HERO who once saved two children from drowning in a lake rescues three men from a toxic sewer.\nIf all had gone well, this was how the world would have hailed Satish Singh. But then, all didn’t go well.\nLate on Tuesday, 38-year-old Satish, a fitne... [4516 chars]",
    "url": "https://indianexpress.com/article/cities/delhi/when-most-looked-the-other-way-a-good-samaritan-risked-his-life-and-died-7845195/",
    "image": "https://images.indianexpress.com/2022/03/Satish-Singh.jpg",
    "publishedAt": "2022-03-30T22:30:36Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Fitness alert: Try these three advanced-level effective variations of push-ups",
    "description": "Keep in mind to never try these variations if you are a beginner",
    "content": "If you are a beginner, there are a few things you need to know about fitness, especially push-ups — it is not a random workout. According to Vijay Thakkar, a fitness entrepreneur, functional medicine coach and founder of 48 Fitness, every push-up pus... [2340 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/fitness-advanced-level-effective-variations-push-ups-7818220/",
    "image": "https://images.indianexpress.com/2022/03/GettyImages-pushup-1200.jpg",
    "publishedAt": "2022-03-30T12:00:55Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "IPL 2022: PBKS' Rajapaksa seeks meeting with Kohli to take fitness to next level",
    "description": "Dropped from the national team over fitness issues, Rajapaksa now wants to have a conversation with a supremely-fit Virat Kohli, who he calls the 'Cristiano Ronaldo of cricket'.",
    "content": "Follow us on Image Source : IPL File Photo of Bhanuka Rajapaksa\nSkills \"come first\" for Bhanuka Rajapaksa but the Sri Lankan batter has realised that survival in modern-day cricket is not possible without attaining required fitness standards.\nDropped... [4133 chars]",
    "url": "https://www.indiatvnews.com/sports/cricket/ipl-2022-pbks-rajapaksa-seeks-meeting-with-kohli-to-take-fitness-to-next-level-2022-03-30-766705",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/mitchell-marsh-2-1648640996.jpg",
    "publishedAt": "2022-03-30T11:50:23Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Shehnaaz Gill reveals her guilt-free diet secrets so that you won't have to ditch your favourite paranthas",
    "description": "Shehnaaz recently appeared on actor Shilpa Shetty's show 'Shape Of You', wherein she opened up about her fitness journey and how she transformed herself during the lockdown. Read here to know how you can have a fit body like her.",
    "content": "Follow us on Image Source : INSTAGRAM/SHEHNAAZ GILL Shehnaaz Gill's diet for a healthy lifestyle\nNorth Indian people, especially, Punjabis' lives are incomplete without lip-smacking paranthas loaded with ghee/butter. But those who are on a mission to... [1492 chars]",
    "url": "https://www.indiatvnews.com/health/shehnaaz-gill-reveals-guilt-free-diet-secrets-you-wont-have-to-ditch-your-favourite-paranthas-celeb-diet-plans-2022-03-30-766687",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/pjimage-2022-03-30t154223-1648635149.jpg",
    "publishedAt": "2022-03-30T10:14:05Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Fitness watch: What is plyometric training and how it can help improve strength",
    "description": "The aim of plyometric training is to train the muscles, tendons and nervous system to get better at using their elastic energy.",
    "content": "It’s recommended that people get 150 minutes of moderate to vigorous physical activity a week. But the part of this advice that people often ignore is that we should do muscle strengthening exercises twice a week.\nWhen we think of muscle strengthenin... [5577 chars]",
    "url": "https://scroll.in/field/1020709/fitness-watch-what-is-plyometric-training-and-how-it-can-help-improve-strength",
    "image": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/172288-ksyphvcxga-1648631136.jpg",
    "publishedAt": "2022-03-30T09:13:00Z",
    "source": {
      "name": "Scroll.in",
      "url": "https://scroll.in"
    }
  }
]