[
  {
    "title": "Sussanne Khan is a pro at jump squats; take a look",
    "description": "This high-intensity workout is very good for the body -- check it out!",
    "content": "Many celebs promote fitness videos on their social media, but there is no one quite as pro as Sussanne Khan when it comes to a particular exercise routine: jump squats.\nThe 43-year-old took to Instagram to share a video in which she was seen performi... [1503 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/sussanne-khan-pro-jump-squats-celeb-fitness-7847814/",
    "image": "https://images.indianexpress.com/2022/04/Sussanne-Khan-1200.jpg",
    "publishedAt": "2022-04-12T03:40:25Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Ranbir Kapoor-Alia Bhatt Wedding: Groom-to-be Reveals his Workout Routine and Diet Regime",
    "description": "Ranbir Kapoor always prefers to stay away from social media and the virtual world which makes it almost impossible for us to learn more about him",
    "content": "Ranbir Kapoor is one of the most talented, versatile and fittest actors in the Bollywood industry. He has given hits like Barfi, Yeh Jawani hai Dewaani, Sanju and many more. Interestingly, this Bollywood heartthrob will tie the knot with actress Alia... [1851 chars]",
    "url": "https://www.news18.com/news/lifestyle/ranbir-kapoor-alia-bhatt-wedding-groom-to-be-reveals-his-workout-routine-and-diet-regime-4961702.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/04/pjimage-9-164900135316x9.jpg",
    "publishedAt": "2022-04-11T05:17:28Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
"title": "Core Home Fitness Adjustable Dumbbell Set review",
"description": "Want to boost your home fitness regime? Core’s Adjustable Dumbbell Set might just change the way you approach workouts.",
"content": "The Core Home Fitness Adjustable Dumbbell Set innovates the adjustable dumbbell, creating a satisfying workout experience that will leave you raring to get your hands around them, day after day. The Core Home Fitness Adjustable Dumbbell Set innovates... [5717 chars]",
"url": "https://www.techradar.com/reviews/core-home-fitness-adjustable-dumbbell-set",
"image": "https://cdn.mos.cms.futurecdn.net/2iZFz8ubFN59jhAcYnzevY-1200-80.jpeg",
"publishedAt": "2022-04-12T14:42:21Z",
"source": {
"name": "TechRadar",
"url": "https://www.techradar.com"
}
},
  {
"title": "Fitness+ launches new workout program to get fit after having a baby",
"description": "Apple Fitness+ has launched a new workout program for women who are looking to get back into fitness after having a baby.",
"content": "Apple Fitness+ has had a workout program for a while on how to stay active while pregnant, but they have not yet had a program to help new mothers get back into their fitness routine - until now. On Monday, the workout subscription service launched a... [296 chars]",
"url": "https://www.imore.com/fitness-launches-new-workout-program-get-fit-after-having-baby",
"image": "https://www.imore.com/sites/imore.com/files/styles/large/public/field/image/2022/04/apple-fitness-plus-fit-after-baby.jpg",
"publishedAt": "2022-04-12T14:01:47Z",
"source": {
"name": "iMore",
"url": "https://www.imore.com"
}
},
  {
"title": "Apple Watch and Galaxy Watch 4 are great for physical fitness but terrible for mental health",
"description": "Smartwatches give us more actionable data for our body's physical state than ever before, along with regular reminders to get up and move. Sometimes this helps, and sometimes this makes things worse.",
"content": "In the past year, I've worn watches or trackers from Fitbit, Garmin, Apple, Samsung, and Amazfit, and each has its own special way of prodding me about all my responsibilities during the day while also warning me I've been sitting too much. And boy, ... [6740 chars]",
"url": "https://www.androidcentral.com/wearables/apple-watch-and-galaxy-watch-4-are-great-for-physical-fitness-but-terrible-for-mental-health",
"image": "https://cdn.mos.cms.futurecdn.net/PReK4xcbhY6px5gXUxxETD-1200-80.jpeg",
"publishedAt": "2022-04-12T12:00:14Z",
"source": {
"name": "Android Central",
"url": "https://www.androidcentral.com"
}
},
  {
"title": "Rock Steady Boxing using boxing to help symptoms of Parkinson’s Disease",
"description": "Champaign, Ill. (WCIA) April is Parkinson’s Awareness Month. Rock Steady Boxing is a fitness and training gym designed uniquely for people with Parkinson’s Disease (PWP) using training exercises used by boxers. We use boxing as an effective exercise against the symptoms of PD.We also use fitness exercise to improve overall health and camaraderie among the ",
"content": "Champaign, Ill. (WCIA) April is Parkinson’s Awareness Month. Rock Steady Boxing is a fitness and training gym designed uniquely for people with Parkinson’s Disease (PWP) using training exercises used by boxers. We use boxing as an effective exercise ... [802 chars]",
"url": "https://www.wcia.com/ciliving-tv/rock-steady-boxing-using-boxing-to-help-symptoms-of-parkinsons-disease/",
"image": "https://www.wcia.com/wp-content/uploads/sites/44/2022/04/ROCK-STEADY-BOXING-LOGO-Full_Screen_Template.jpg?w=1280",
"publishedAt": "2022-04-11T20:47:50Z",
"source": {
"name": "wcia.com",
"url": "https://www.wcia.com"
}
},
  {
"title": "You and your dog could get paid £500 just for exercising together",
"description": "OriGym is looking for a pair to be the faces of The Ultimate Doggy Workout",
"content": "A Devon dog and owner could bag themselves £500 simply for exercising together. If you and your furry friend both love keeping fit and having fun together, and don’t mind being filmed doing it, you could become the next fitness stars. Personal traine... [2208 chars]",
"url": "https://www.devonlive.com/whats-on/family-kids/you-your-dog-could-paid-6941676",
"image": "https://i2-prod.devonlive.com/incoming/article6941693.ece/ALTERNATES/s1200/0_CA_DL_12042022_origym.jpg",
"publishedAt": "2022-04-12T12:22:53Z",
"source": {
"name": "Devon Live",
"url": "https://www.devonlive.com"
}
},
  {
    "title": "Five skincare hacks to ‘prevent breakouts from your workouts’",
    "description": "The sweat released during the workout can lead to skin issues like acne breakouts, irritation, redness and rashes",
    "content": "Physical activities are known to be beneficial for the skin, and help it give a natural and healthy glow. The sweat released during workouts, however, can also lead to skin issues like acne breakouts, irritation, redness and rashes. So, to reap the m... [1215 chars]",
    "url": "https://indianexpress.com/article/lifestyle/five-skincare-hacks-to-prevent-breakouts-from-your-workouts-7806794/",
    "image": "https://images.indianexpress.com/2022/03/workout-skincare-1200.jpg",
    "publishedAt": "2022-04-06T06:00:05Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
"title": "Score Up to 50% Off Athleta's New Sale Styles",
"description": "Add these sports bras, leggings, tanks and other workout essentials to your spring wardrobe.",
"content": "We independently selected these deals and products because we love them, and we think you might like them at these prices. If you buy through our links, E! may make a commission on your purchase. Prices are accurate as of publish time. Items are sold... [660 chars]",
"url": "https://www.eonline.com/news/1326730/score-up-to-50-off-athletas-new-sale-styles",
"image": "https://akns-images.eonline.com/eol_images/Entire_Site/202238/rs_1200x1200-220408175517-1200-workout.jpg?fit=around%7C1080:566&output-quality=90&crop=1080:566;center,top",
"publishedAt": "2022-04-10T13:00:00Z",
"source": {
"name": "E! NEWS",
"url": "https://www.eonline.com"
}
},
{
"title": "Weight loss goals: Six not-so-healthy eating habits that you need to break",
"description": "Start thinking about your diet and lifestyle differently, says an expert",
"content": "While health and fitness goals are set by many — which mostly involve weight loss — people make some eating mistakes which slow their progress. If you are one of them, nutritionist Bhakti Kapoor advises you not to make the following six mistakes. Tak... [1071 chars]",
"url": "https://indianexpress.com/article/lifestyle/health/weight-loss-goals-healthy-eating-habits-unhealthy-habits-7851029/",
"image": "https://images.indianexpress.com/2022/04/GettyImages-healthy-unhealthy-eating-1200.jpg",
"publishedAt": "2022-04-04T15:20:06Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
}
]