[
  {
    "title": "Ananya Panday Swears by her Yoga Handstand, Know its Benefits",
    "description": "Ananya Panday follows a very basic fitness regime, which doesn’t involve any weight training and strength training but revolves around yoga",
    "content": "Time and again, Ananya Panday has proved that you don’t need rigorous cardio sessions or intense weight-lifting workouts to stay fit and healthy. The actress follows a very basic fitness regime, which doesn’t involve any weight training and strength ... [1946 chars]",
    "url": "https://www.news18.com/news/lifestyle/ananya-panday-swears-by-her-yoga-handstand-know-its-benefits-4944314.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/03/ananya-panday-3-3-164796649616x9.jpg",
    "publishedAt": "2022-04-05T15:24:36Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Weight Loss on Your Mind? Follow These Steps to Leave Behind your Unhealthy Eating Habits",
    "description": "Undeniably, we try very hard to achieve the health and fitness goals set by us, but without knowing, we are attempting a few mistakes that are causing hindrance to the whole process",
    "content": "Each and everyone’s wish list contains one common point and that is weight loss. But despite leaving no stones unturned and trying everything possible, losing weight can seem like an impossible task. Undeniably, we try very hard to achieve the health... [2273 chars]",
    "url": "https://www.news18.com/news/lifestyle/weight-loss-on-your-mind-follow-these-steps-to-leave-behind-your-unhealthy-eating-habits-4944197.html",
    "image": "https://images.news18.com/ibnlive/uploads/2021/11/weight-loss-drinks-163591840216x9.jpg",
    "publishedAt": "2022-04-05T15:21:29Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Golf-Matsuyama up front about fitness but Champions Dinner menu a question mark",
    "description": "Japan's Hideki Matsuyama declared himself fit to defend his Masters title but the Champions Dinner menu remained a big question mark on Tuesday. Neck and back issues have disrupted Matsuyama's Masters preparations and the 30-year-old conceded that the last few weeks have been a struggle.",
    "content": "Japan's Hideki Matsuyama declared himself fit to defend his Masters title but the Champions Dinner menu remained a big question mark on Tuesday.\nNeck and back issues have disrupted Matsuyama's Masters preparations and the 30-year-old conceded that th... [2014 chars]",
    "url": "https://www.devdiscourse.com/article/sports-games/1991660-golf-matsuyama-up-front-about-fitness-but-champions-dinner-menu-a-question-mark",
    "image": "https://www.devdiscourse.com/images/sports/golf-2.jpg?width=920&format=jpeg",
    "publishedAt": "2022-04-05T14:34:06Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
    "title": "Ministry of Ayush to organise grand yoga event on World Health Day at Red Fort",
    "description": "On April 7, various personalities from sports, health and fitness and government representatives will participate in a Yoga event to be organised near the Red Fort in Delhi. India TV Chairman and Editor-in-Chief is also invited to be part of the programme.",
    "content": "Follow us on Image Source : INDIA TV India TV's Chairman and Editor-in-Chief Rajat Sharma has been invited to be part of a Yoga programme organised by Govt of India\nMinistry of Ayush is organising a grand programme for demonstration of Common Yoga Pr... [1615 chars]",
    "url": "https://www.indiatvnews.com/lifestyle/books-culture/ministry-of-ayush-to-organise-grand-yoga-event-on-world-health-day-at-red-fort-2022-04-05-767891",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/rajat-sharma-1649166857.jpg",
    "publishedAt": "2022-04-05T13:46:18Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Apple Fitness+ adds workouts for new mothers",
    "description": "The workouts are intended to help new mothers to feel stronger and more energetic. The exercises are all led by trainer Betina Gozo, who also presented the workouts for the 'Stay Active During Pregnancy' series Apple released for the service in April 2021.",
    "content": "Follow us on Image Source : WEBSITE: APPLE Apple Fitness+ adds workouts for new mothers\nApple Fitness+ has expanded its selection of workouts for mothers, with a collection of videos to help with regaining fitness following a pregnancy.\nThe workouts ... [1028 chars]",
    "url": "https://www.indiatvnews.com/technology/news/apple-fitness-adds-workouts-for-new-mothers-2022-04-05-767771",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/apple-fitness-1649135228.jpg",
    "publishedAt": "2022-04-05T05:07:42Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Raising mercury! Guess the price of Disha Patani's spaghetti strap dress",
    "description": "While Disha herself is a big fan of fitness, which means her closet is full of athleisure clothing, she is also a lot into dresses, especially hot dre",
    "content": "She is one of the hottest actresses in Bollywood and besides setting fitness goals on a daily basis, Disha Patani keeps on dropping style inspo for her fans, every now and then. While Disha herself is a big fan of fitness, which means her closet is f... [1298 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/fashion/celeb-style/raising-mercury-guess-the-price-of-disha-patanis-spaghetti-strap-dress/articleshow/90649889.cms",
    "image": "https://static.toiimg.com/thumb/msid-90649889,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-69564/90649889.jpg",
    "publishedAt": "2022-04-05T04:30:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  {
    "title": "I’d scan my brain if I wake up as Ronaldo: Kohli",
    "description": "A big fan of Ronaldo's work ethics and fitness regime, Kohli expressed his admiration for the star footballer during a photoshoot for his IPL franchise Royal Challengers Bangalore.",
    "content": "A huge fan of Cristiano Ronaldo, star India batter Virat Kohli says he would do a scan of his brain if he wakes up one day as the Portuguese football icon.\nA big fan of Ronaldo’s work ethics and fitness regime, Kohli expressed his admiration for the ... [1712 chars]",
    "url": "https://indianexpress.com/article/sports/cricket/id-scan-my-brain-if-i-wake-up-as-ronaldo-kohli-7852792/",
    "image": "https://images.indianexpress.com/2022/04/virat-kohli-cristiano-ronaldo.jpg",
    "publishedAt": "2022-04-04T14:53:54Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Apple Fitness Plus Now Includes Post-Childbirth Exercise Routines",
    "description": "The program includes mindfulness for parents.",
    "content": "> fitness\nAfter giving birth, postpartum exercise is something that should be navigated consciously and safely. Apple Fitness Plus is stepping in with a new workout program tailored to this period, called 'Get Back to Fitness After Having a Baby'.\nAp... [1009 chars]",
    "url": "https://in.mashable.com/fitness/29694/apple-fitness-plus-now-includes-post-childbirth-exercise-routines",
    "image": "https://sm.mashable.com/t/mashable_in/article/a/apple-fitn/apple-fitness-plus-now-includes-post-childbirth-exercise-rou_q7ww.1200.jpg",
    "publishedAt": "2022-04-04T05:38:07Z",
    "source": {
      "name": "Mashable India",
      "url": "https://in.mashable.com"
    }
  },
  {
    "title": "Demotivated to workout? Here’s one science-approved way to get moving again",
    "description": "A study found that using fitness apps increased everyday physical activity by an equivalent of 1,235 steps, and moderate and vigorous physical activity by 48.5 minutes a week",
    "content": "Fitness trackers and monitors were all the rage when they were newly launched in India. Everyone wanted one, no matter how often they worked out. But for fitness enthusiasts, it remains a daily necessity for monitoring their workouts, calories burned... [2673 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/demotivated-to-workout-heres-one-science-approved-way-to-get-moving-again-7844496/",
    "image": "https://images.indianexpress.com/2022/03/fitness-tracker.jpg",
    "publishedAt": "2022-04-03T04:51:31Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Badshah admits being clinically depressed, reveals suffering from anxiety & sleep apnea",
    "description": "Badshah said that to maintain his mental health, one has to be selfish. 'Mental fitness is my priority in life. Mental peace is a luxury for me because of the pressure that we face every day. I have been through the darkest times when it comes to my mental health.'",
    "content": "Follow us on Image Source : INSTAGRAM/BADSHAH Badshah\nAfter India's Got Talent 9, Shilpa Shetty and Badshah have reunited for the former's talk show, 'Shape of You'. In a candid conversation, the singer-musician opened up about his mental health jour... [2015 chars]",
    "url": "https://www.indiatvnews.com/entertainment/celebrities/badshah-admits-being-clinically-depressed-reveals-suffering-from-anxiety-sleep-apnea-2022-04-02-767281",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/pjimage-4-1648901414.jpg",
    "publishedAt": "2022-04-02T12:22:59Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  }
]