[{
"title": "The More You Sweat The More Fat You Lose- True Or Just A Myth? And More",
"description": "Weight loss myths: 'Don't even get me started,' the celebrity fitness trainer wrote. She discussed these myths on Instagram Reels.",
"content": "Weight loss myths: Exercise cannot compensate for a bad diet Highlights Sweating is not related to the amount of fat you lose Your muscles will not turn into fat if you stop exercising Pilates are for both men and women The world is full of myths. An... [2515 chars]",
"url": "https://www.ndtv.com/health/the-more-you-sweat-the-more-fat-you-lose-true-or-just-a-myth-and-more-2503147",
"image": "https://c.ndtvimg.com/7a13g58_workout_625x300_18_July_18.jpg",
"publishedAt": "2021-08-05T06:50:01Z",
"source": {
"name": "NDTV News",
"url": "https://www.ndtv.com"
}
},{
"title": "Study finds the best workout to improve mental health; but overindulgence might not be good",
"description": "A research study on ways to combat depression has revealed that people who are engaged in team sports, cycling, aerobics or go to gym daily have a bet",
"content": "A research study on ways to combat depression has revealed that people who are engaged in team sports, cycling, aerobics or go to gym daily have a better mental health than those who do not.The study published in The Lancet Psychiatry journal in 2018... [2390 chars]",
"url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/study-finds-the-best-workout-to-improve-mental-health-but-overindulgence-might-not-be-good/articleshow/91227633.cms",
"image": "https://static.toiimg.com/thumb/msid-91227619,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1007147/91227619.jpg",
"publishedAt": "2022-05-01T13:30:00Z",
"source": {
"name": "Times of India",
"url": "https://timesofindia.indiatimes.com"
}
},{
"title": "Here's how you can improve your overall health by early morning walks",
"description": "Morning walk is one of the easiest ways you can complete your day's workout without tiring yourself.",
"content": "Morning walk is one of the easiest ways you can complete your day's workout without tiring yourself. Waking up early to go for an early morning walk is still a nightmare for many of us. As kids, we were often told about the benefits of morning walk a... [1763 chars]",
"url": "https://www.firstpost.com/living/heres-how-you-can-improve-your-overall-health-by-early-morning-walks-10631761.html",
"image": "https://images.firstpost.com/wp-content/uploads/2021/01/Racewalking-640-Reuters.jpg",
"publishedAt": "2022-05-04T09:52:07Z",
"source": {
"name": "Firstpost",
"url": "https://www.firstpost.com"
}
},{
    "title": "Fitness coach shares five benefits Men can enjoy in the long run if they practise Pilates regularly",
    "description": "\"Practice Pilates on a regular basis. No matter what age!\" fitness coach Neelam Mangat said on Instagram",
    "content": "Over the years, Pilates has become a popular form of exercise that even many celebrities swear by. However, there is also a common misconception that it is more beneficial for women. But is it so?\nStressing that Pilates is a wholesome exercise that i... [1273 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/pilates-for-men-fitness-benefits-7897213/",
    "image": "https://images.indianexpress.com/2022/05/Pilates_1200_getty.jpg",
    "publishedAt": "2022-05-04T13:30:47Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },{
    "title": "Suffering from respiratory issues? Know how Yoga and Pranayamas can help",
    "description": "Pranayama, and a nutritious diet. Controlled breathing, also known as Pranayama, is a technique known to increase our lung capacity and overall bodily functions through regular practise by controlling inspiration and expiration.",
    "content": "Follow us on Image Source : INSTAGRAM/ANABEL_OTERO How Yoga, Pranayama can help in respiratory issues\nBreathing is necessary for survival. When you breathe properly, it reduces stress and boosts your immunity, allowing you to stay healthy. Regular an... [3672 chars]",
    "url": "https://www.indiatvnews.com/health/suffering-from-respiratory-issues-know-how-yoga-and-pranayamas-can-help-2022-05-06-774601",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/05/pranayamas-1651822269.jpg",
    "publishedAt": "2022-05-06T07:33:47Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },{
"title": "Dumbbell vs Kettlebell: How to choose between dumbbell and kettlebell during workout",
"description": "Among the weight training equipment, dumbbells and kettlebells are staple to every gym and workout space. But how do they differ in efficacy and usefu",
"content": "Celebrity trainer Shivoham recently shared in an exclusive interview how weight training is the key to losing weight. Whether you are doing weight training with weights or bodyweight, people must include resistance training in their workout routine.... [2055 chars]",
"url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/dumbbell-vs-kettlebell-how-to-choose-between-dumbbell-and-kettlebell-during-workout/articleshow/91341874.cms",
"image": "https://static.toiimg.com/thumb/msid-91342116,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-65258/91342116.jpg",
"publishedAt": "2022-05-06T01:30:00Z",
"source": {
"name": "Times of India",
"url": "https://timesofindia.indiatimes.com"
}
},{
"title": "12 gifts for moms who love fitness",
"description": "If you’re shopping for moms who love fitness, there's a variety of niche gifts ranging from insulated water bottles to high-end sports equipment.",
"content": "Which are the best 12 gifts for moms who love fitness? Mother’s Day is only a week away, and many people are still looking for the perfect gift. If you’re shopping for moms who love fitness, you might find your search challenging, considering you hav... [6293 chars]",
"url": "https://fox8.com/reviews/br/sports-fitness-br/12-gifts-for-moms-who-love-fitness/",
"image": "https://fox8.com/wp-content/uploads/sites/12/2022/04/1040x585-2022-0428-gifts-for-mothers-who-love-fitness3-70f4aa.jpg?w=1280",
"publishedAt": "2022-04-29T23:19:09Z",
"source": {
"name": "WJW FOX 8 News Cleveland",
"url": "https://fox8.com"
}
},
{
"title": "Fitness alert: Count on these yoga poses to help fix your posture",
"description": "We can’t always control our environment but we can at least start taking care of our posture, said yoga expert Srishti Kaushik in an Instagram post.",
"content": "Amidst the hustle and bustle of everyday life, regular physical activity can sometimes take a back seat. Physical inactivity combined with concerns such as an unhealthy diet, irregular meal times, lack of sleep, and stress can harm your health as wel... [2155 chars]",
"url": "https://indianexpress.com/article/lifestyle/fitness/fitness-alert-yoga-poses-to-help-fix-your-posture-7797771/",
"image": "https://images.indianexpress.com/2022/03/fitness-1200.jpg",
"publishedAt": "2022-04-30T03:40:40Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
{
"title": "Fitness fanatic dad defies life-threatening heart condition to shed four stone",
"description": "Portly company director with heart like a “ticking time bomb” becomes gym bunny with a six pack despite being told exercise could kill him",
"content": "Something went wrong, please try again later. Get the stories that matter to our community straight to your inbox with our Daily Newsletter A company director who was told exercise could kill him because his heart was like a “ticking timebomb” defied... [4582 chars]",
"url": "https://www.plymouthherald.co.uk/news/uk-world-news/fitness-fanatic-dad-defies-life-6998994",
"image": "https://i2-prod.hulldailymail.co.uk/incoming/article6998982.ece/ALTERNATES/s1200/0_man-in-gym.png",
"publishedAt": "2022-04-30T05:00:00Z",
"source": {
"name": "Plymouth Live",
"url": "https://www.plymouthherald.co.uk"
}
},
  {
"title": "The Five Biggest Mistakes to Avoid When Starting to Work Out",
"description": "If you're an exercise newbie, it's easy to feel out of your depth. Fitness experts Charlee Atkins and Drew Schwartz explain how to dodge pitfalls—without pulling a muscle.",
"content": "There are many benefits to getting fit, from strengthening your bones to improving your sleep and boosting your mental health. But if you've never exercised before, starting to work out can seem overwhelming, especially when making a mistake might le... [4968 chars]",
"url": "https://www.newsweek.com/five-biggest-mistakes-avoid-starting-work-out-fitness-1697524",
"image": "https://d.newsweek.com/en/full/2019580/women-sitting-yoga-mat.jpg",
"publishedAt": "2022-04-23T12:00:01Z",
"source": {
"name": "Newsweek",
"url": "https://www.newsweek.com"
}
},
{
"title": "I did 100 dead bugs a day for a week and was surprised by the results",
"description": "Are dead bugs a good abdominal workout? Here's what happens when our fitness editor did 100 dead bugs a day for a week.",
"content": "As a fitness editor, I’m no stranger to a workout challenge. From a week-long ab challenge to a week of squats, ( no, you shouldn’t do a squat challenge ), I’ve experimented with a number of different workouts over the years. Yet in my quest to find ... [4439 chars]",
"url": "https://www.tomsguide.com/news/i-did-100-dead-bugs-a-day-for-a-week-and-was-surprised-by-the-results",
"image": "https://cdn.mos.cms.futurecdn.net/F7RB5mAVvBLKHyavz2EUFc-1200-80.jpg",
"publishedAt": "2022-04-30T08:00:00Z",
"source": {
"name": "Tom's Guide",
"url": "https://www.tomsguide.com"
}
},
  
  
  {
    "title": "Why is it time to stop giving weight loss compliments?",
    "description": "We equate weight loss to fitness. And we have been doing this wrong since the first time we were exposed to the pre-set beauty standards.",
    "content": "Read Also5 common mistakes people makes when trying to lose belly fat\nWe equate weight loss to fitness. And we have been doing this wrong since the first time we were exposed to the pre-set beauty standards. We started idolizing thin body and fair sk... [2446 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/why-is-it-time-to-stop-giving-weight-loss-compliments/articleshow/90977804.cms",
    "image": "https://static.toiimg.com/thumb/msid-90978211,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1568303/90978211.jpg",
    "publishedAt": "2022-04-22T01:30:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  
  
  {
"title": "How to Lose Face Fat: Do Facial Exercises Work?",
"description": "Is it really possible to lose fat from a specific part of your body? We ask health and fitness experts about how to banish face fat.",
"content": "You've all seen the ads: miracle fat burner, banish that double chin, watch your face fat melt away. There are a lot of wild promises out there about health and fitness, including the best way to lose face fat. Weight loss works differently for every... [4847 chars]",
"url": "https://www.newsweek.com/how-lose-face-fat-do-facial-exercises-work-1697906",
"image": "https://d.newsweek.com/en/full/2020518/woman-pulling-her-cheeks.jpg",
"publishedAt": "2022-04-22T12:00:01Z",
"source": {
"name": "Newsweek",
"url": "https://www.newsweek.com"
}
},
 
 {
"title": "I tried this 15-minute dumbbell workout - and could barely lift my arms the next day",
"description": "A 15-minute dumbbell workout that targets your arm muscles. Here's what happened when we tried Fraser Wilson’s 15-minute arm workout.",
"content": "I’ll caveat this article by pointing out that, as a runner, arms are very much a neglected part of my workout routine. I’ll spend hours working on building my glute strength to help me power through the final miles of a marathon (here’s how to build ... [4542 chars]",
"url": "https://www.tomsguide.com/news/i-tried-this-15-minute-dumbbell-workout-with-over-5-million-views-heres-what-happened",
"image": "https://cdn.mos.cms.futurecdn.net/iKwyN82wdqrkYNUhRC2EcH-1200-80.jpg",
"publishedAt": "2022-04-22T07:01:54Z",
"source": {
"name": "Tom's Guide",
"url": "https://www.tomsguide.com"
}
},
{
"title": "Fitness watch: Barbell exercises are ‘must do’ exercises for many but the truth isn’t as simple",
"description": "If your goals are to build muscle and get stronger, the most important thing you need to do is place the muscle under load and progressively do more over time.",
"content": "If strong is the new sexy, it’s no wonder more people than ever want to start lifting weights. Instagram hashtags such as “fitspiration” (fitness inspiration) and #gym contain millions of posts, typically of flexed muscles, inspirational quotes and e... [4929 chars]",
"url": "https://scroll.in/field/1022981/fitness-watch-barbell-exercises-are-must-do-exercises-for-many-but-the-truth-isnt-as-simple",
"image": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/173761-ozinyckgdv-1651307009.jpg",
"publishedAt": "2022-04-30T08:24:00Z",
"source": {
"name": "Scroll.in",
"url": "https://scroll.in"
}
},
{
    "title": "Guinness World Records: Chinese man clocks most muscle ups in one hour",
    "description": "\"You need immense arm, core and grip strength to perform this movement,\" said certified fitness trainer Sameeran Chetia",
    "content": "Guinness World Records 2022 recently announced that Chinese man Xiao Lin has clocked most muscle ups in one hour by performing 402 reps in an hour to create the remarkable record.\nThe video of Lin performing the fitness activity was shared by Guinnes... [1651 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/guinness-world-records-chinese-man-lin-most-muscle-ups-one-hour-fitness-core-strength-7883359/",
    "image": "https://images.indianexpress.com/2022/04/guinness_1200_guinness.com_.jpg",
    "publishedAt": "2022-04-26T12:50:57Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  }
 
]