[
{
"title": "One of the best pre-workout fruits for diabetics is…",
"description": "Do not combine it with meals. Try to eat the whole fruit, not juice, and don’t add fruits to a vegetable salad because fructose eaten with veggies will delay digestion and bloat you up, said Dr Ria Banerjee Ankola",
"content": "Owing to its many health benefits and the instant boost of energy it provides, many people swear by a banana as their pre-workout snack. But, it is not considered to be the best fruit for diabetics as it has a higher fructose content that can lead to... [2147 chars]",
"url": "https://indianexpress.com/article/lifestyle/health/diabetics-fruits-banana-pre-workout-fruit-watermelon-7853752/",
"image": "https://images.indianexpress.com/2022/02/GettyImages-body-weight-fat-exercise-1200-1.jpg",
"publishedAt": "2022-04-06T11:30:35Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
{
"title": "Here’s why you don’t need to feel sore after a workout to know it’s worked",
"description": "There are many reasons why your muscles might get sore after a workout. But, contrary to popular belief, you don't necessarily need to feel sore in the hours or days after exercise to know you've had a good workout.",
"content": "‘No pain, no gain’ is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you’ve done enough. There are many reasons why your muscles might get sore... [4745 chars]",
"url": "https://indianexpress.com/article/lifestyle/fitness/why-you-dont-need-to-feel-sore-after-a-workout-to-know-its-worked-7851832/",
"image": "https://images.indianexpress.com/2022/04/GettyImages-muscle-soreness-1200.jpg",
"publishedAt": "2022-04-06T06:30:08Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
{
"title": "Five skincare hacks to ‘prevent breakouts from your workouts’",
"description": "The sweat released during the workout can lead to skin issues like acne breakouts, irritation, redness and rashes",
"content": "Physical activities are known to be beneficial for the skin, and help it give a natural and healthy glow. The sweat released during workouts, however, can also lead to skin issues like acne breakouts, irritation, redness and rashes. So, to reap the m... [1215 chars]",
"url": "https://indianexpress.com/article/lifestyle/five-skincare-hacks-to-prevent-breakouts-from-your-workouts-7806794/",
"image": "https://images.indianexpress.com/2022/03/workout-skincare-1200.jpg",
"publishedAt": "2022-04-06T06:00:05Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
{
"title": "Study details how exercise reduces depression",
"description": "Regular exercise is a wonderful tool for overcoming depression .According to a new study led by researchers at the Iowa State University, exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify the benefits of therapy.",
"content": "Regular exercise is a wonderful tool for overcoming depression. According to a new study led by researchers at the Iowa State University, exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify t... [4947 chars]",
"url": "https://www.devdiscourse.com/article/lifestyle/1988452-study-details-how-exercise-reduces-depression",
"image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_04_2022_05_40_04_1934953.jpg?width=920&format=jpeg",
"publishedAt": "2022-04-03T05:40:05Z",
"source": {
"name": "Devdiscourse",
"url": "https://www.devdiscourse.com"
}
},
{
"title": "Demotivated to workout? Here’s one science-approved way to get moving again",
"description": "A study found that using fitness apps increased everyday physical activity by an equivalent of 1,235 steps, and moderate and vigorous physical activity by 48.5 minutes a week",
"content": "Fitness trackers and monitors were all the rage when they were newly launched in India. Everyone wanted one, no matter how often they worked out. But for fitness enthusiasts, it remains a daily necessity for monitoring their workouts, calories burned... [2673 chars]",
"url": "https://indianexpress.com/article/lifestyle/fitness/demotivated-to-workout-heres-one-science-approved-way-to-get-moving-again-7844496/",
"image": "https://images.indianexpress.com/2022/03/fitness-tracker.jpg",
"publishedAt": "2022-04-03T04:51:31Z",
"source": {
"name": "The Indian Express",
"url": "https://indianexpress.com"
}
},
{
"title": "Twist your Workout with These Advance Level Push-Ups",
"description": "People who follow an intense workout regime follow attempt more than 300 pushups a day",
"content": "Every fitness enthusiast across the globe is well aware that a proper workout session is incomplete if it doesn’t include bouts of push-ups. And why not? After all the traditional style push-ups are extremely beneficial in building your upper body st... [1909 chars]",
"url": "https://www.news18.com/news/lifestyle/twist-your-workout-with-these-advance-level-push-ups-4933217.html",
"image": "https://images.news18.com/ibnlive/uploads/2022/04/push-ups-workout-164889494116x9.jpg",
"publishedAt": "2022-04-02T14:30:12Z",
"source": {
"name": "News18",
"url": "https://www.news18.com"
}
},
{
"title": "Fitness watch: You don’t necessarily need to feel sore in the hours or days after exercise",
"description": "Delayed onset muscle soreness is the scientific term to describe the sore and tender feeling our muscles have after a workout",
"content": "“No pain, no gain” is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you’ve done enough. There are many reasons why your muscles might get sore... [4508 chars]",
"url": "https://scroll.in/field/1020883/fitness-watch-you-dont-necessarily-need-to-feel-sore-in-the-hours-or-days-after-exercise",
"image": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/151335-xifgbkerka-1606724146.jpg",
"publishedAt": "2022-04-02T10:30:00Z",
"source": {
"name": "Scroll.in",
"url": "https://scroll.in"
}
},
{
"title": "Exercise may reduce depression, boost effects of therapy: Study",
"description": "Exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify the benefits of therapy, according to a new study led by researchers at the Iowa State University.",
"content": "Exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and amplify the benefits of therapy, according to a new study led by researchers at the Iowa State University. The findings of the research were publis... [4888 chars]",
"url": "https://www.devdiscourse.com/article/lifestyle/1987773-exercise-may-reduce-depression-boost-effects-of-therapy-study",
"image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/02_04_2022_10_24_51_3255613.jpg?width=920&format=jpeg",
"publishedAt": "2022-04-02T10:24:52Z",
"source": {
"name": "Devdiscourse",
"url": "https://www.devdiscourse.com"
}
},
{
"title": "The Best Headphones For Running Or Hitting The Gym",
"description": "Whether your most important factor is fit, apps, or sweatproofing, we've gathered the best options for workout headphones.",
"content": "The only things more important to fitness fanatics than their trainers is a quality pair of headphones and a killer playlist. Running without music is like some form of medieval torture: it sucks. And cheap, crappy headphones just aren't going to cut... [1842 chars]",
"url": "https://in.mashable.com/headphones/29557/the-best-headphones-for-running-or-hitting-the-gym",
"image": "https://sm.mashable.com/t/mashable_in/roundup/t/the-best-h/the-best-headphones-for-running-or-hitting-the-gym_598w.1200.jpg",
"publishedAt": "2022-03-31T10:42:02Z",
"source": {
"name": "Mashable India",
"url": "https://in.mashable.com"
}
},
{
"title": "Rashmika Mandanna's Love for Gym Sessions Could Inspire you to Pick Your Own Favourite Workout Routine",
"description": "Dressed in black biker shorts and a loose dusty pink sleeveless top, Rashmika was in for an intense movement exercise routine",
"content": "For South actress Rashmika Mandanna, gym is a place where she can enjoy some fun workout sessions. The 25-year-old actress shared a video from her recent gym session on Instagram. Dressed in black biker shorts and a loose dusty pink sleeveless top, R... [1777 chars]",
"url": "https://www.news18.com/news/lifestyle/rashmika-mandannas-love-for-gym-sessions-could-inspire-you-to-pick-your-own-favourite-workout-routine-4920488.html",
"image": "https://images.news18.com/ibnlive/uploads/2022/03/rashmika-mandanna--164821738716x9.jpg",
"publishedAt": "2022-03-29T12:22:17Z",
"source": {
"name": "News18",
"url": "https://www.news18.com"
}
}
]