[
  {
"title": "The Five Biggest Mistakes to Avoid When Starting to Work Out",
"description": "If you're an exercise newbie, it's easy to feel out of your depth. Fitness experts Charlee Atkins and Drew Schwartz explain how to dodge pitfalls—without pulling a muscle.",
"content": "There are many benefits to getting fit, from strengthening your bones to improving your sleep and boosting your mental health. But if you've never exercised before, starting to work out can seem overwhelming, especially when making a mistake might le... [4968 chars]",
"url": "https://www.newsweek.com/five-biggest-mistakes-avoid-starting-work-out-fitness-1697524",
"image": "https://d.newsweek.com/en/full/2019580/women-sitting-yoga-mat.jpg",
"publishedAt": "2022-04-23T12:00:01Z",
"source": {
"name": "Newsweek",
"url": "https://www.newsweek.com"
}
},
  {
    "title": "Even after crossing 60, I run around 8-10 kms, work out for two hours in the gym and do martial arts: Puneet Issar",
    "description": "The Mahabharat actor shares the secret to his fitness.",
    "content": "Read Also\nPuneet Issar, who recently turned 60, feels it is a myth that people should not train in the gym after a certain age. The actor, who has played the iconic role of Duryodhan in BR Chopra's Mahabharat , shares how he had to maintain a good ph... [1877 chars]",
    "url": "https://timesofindia.indiatimes.com/tv/news/hindi/even-after-crossing-60-i-run-around-8-10-kms-work-out-for-two-hours-in-the-gym-and-do-martial-arts-puneet-issar/articleshow/91000458.cms",
    "image": "https://static.toiimg.com/thumb/msid-91000450,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-53718/91000450.jpg",
    "publishedAt": "2022-04-22T09:12:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  {
    "title": "Chris Hemsworth’s Mountain Workout is the All the Motivation you Need",
    "description": "Hemsworth often shares his workout videos on the social media platform. The actor had launched a fitness app in 2020 for those who wanted to train like the actor himself.",
    "content": "The teaser of Marvel Studios upcoming movie Thor: Love and Thunder has been released and viewers are quite impressed with Hollywood actor Chris Hemsworth’s ripped look. The actor reprises the role of Thor, the superhero in the upcoming movie and in o... [1759 chars]",
    "url": "https://www.news18.com/news/lifestyle/chris-hemsworths-mountain-workout-is-the-all-the-motivation-you-need-5025193.html",
    "image": "https://images.news18.com/ibnlive/uploads/2021/10/chris-hemsworth-as-thor-163534226816x9.jpg",
    "publishedAt": "2022-04-22T08:52:32Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Why is it time to stop giving weight loss compliments?",
    "description": "We equate weight loss to fitness. And we have been doing this wrong since the first time we were exposed to the pre-set beauty standards. We started i",
    "content": "Read Also5 common mistakes people makes when trying to lose belly fat\nWe equate weight loss to fitness. And we have been doing this wrong since the first time we were exposed to the pre-set beauty standards. We started idolizing thin body and fair sk... [2446 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/why-is-it-time-to-stop-giving-weight-loss-compliments/articleshow/90977804.cms",
    "image": "https://static.toiimg.com/thumb/msid-90978211,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-1568303/90978211.jpg",
    "publishedAt": "2022-04-22T01:30:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  {
"title": "Best Fitness Games To Play In 2022",
"description": "If you're looking to have fun and workout, these video games might be just what you need to add to your routine.",
"content": "You don't need to leave the house to get a good workout, and nowadays you can even turn exercising into a game. Fitness video games have increased in popularity over the years, and there is no shortage of options out there that allow you to burn calo... [8826 chars]",
"url": "https://www.gamespot.com/articles/best-fitness-games/1100-6475818/",
"image": "https://www.gamespot.com/a/uploads/screen_kubrick/1591/15918215/3782265-switch_ringfitadventure_01%281%29.jpg",
"publishedAt": "2022-04-22T19:42:46Z",
"source": {
"name": "GameSpot",
"url": "https://www.gamespot.com"
}
},
  {
    "title": "Kriti Sanon sweats it out in the gym and how",
    "description": "\"Strength training helps in burning calories not only during workouts but also while the body is at rest,\" said fitness expert Jitendra Chouksey",
    "content": "The feeling of achieving one’s workout goals cannot be described in words. But to get there, one needs to put in a lot of hardwork and give it time. Looks like actor Kriti Sanon also believes in the same, and hence, is always at the top of her fitnes... [1403 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/kriti-sanon-strength-training-fitness-7865383/",
    "image": "https://images.indianexpress.com/2021/12/Kriti-Sanon-2.jpg",
    "publishedAt": "2022-04-20T03:40:32Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
"title": "How to Lose Face Fat: Do Facial Exercises Work?",
"description": "Is it really possible to lose fat from a specific part of your body? We ask health and fitness experts about how to banish face fat.",
"content": "You've all seen the ads: miracle fat burner, banish that double chin, watch your face fat melt away. There are a lot of wild promises out there about health and fitness, including the best way to lose face fat. Weight loss works differently for every... [4847 chars]",
"url": "https://www.newsweek.com/how-lose-face-fat-do-facial-exercises-work-1697906",
"image": "https://d.newsweek.com/en/full/2020518/woman-pulling-her-cheeks.jpg",
"publishedAt": "2022-04-22T12:00:01Z",
"source": {
"name": "Newsweek",
"url": "https://www.newsweek.com"
}
},
 {
"title": "Top 10 Best Home Workout Android Apps - Updated April 2022",
"description": "Working out should be a part of everyone's routine, in one way or the other. Many people opt to go to a gym to work out, but that is far from essential.",
"content": "Working out should be a part of everyone’s routine, in one way or the other. Many people opt to go to a gym to work out, but that is far from essential. Some of you decide to run outside, or do some other form of exercise. If that works for you, grea... [11600 chars]",
"url": "https://www.androidheadlines.com/best-home-workout-android-apps",
"image": "https://www.androidheadlines.com/wp-content/uploads/2020/12/AH-women-fitness-app-1.jpg",
"publishedAt": "2022-04-22T08:39:54Z",
"source": {
"name": "Android Headlines",
"url": "https://www.androidheadlines.com"
}
},
 {
"title": "I tried this 15-minute dumbbell workout - and could barely lift my arms the next day",
"description": "A 15-minute dumbbell workout that targets your arm muscles. Here's what happened when we tried Fraser Wilson’s 15-minute arm workout.",
"content": "I’ll caveat this article by pointing out that, as a runner, arms are very much a neglected part of my workout routine. I’ll spend hours working on building my glute strength to help me power through the final miles of a marathon (here’s how to build ... [4542 chars]",
"url": "https://www.tomsguide.com/news/i-tried-this-15-minute-dumbbell-workout-with-over-5-million-views-heres-what-happened",
"image": "https://cdn.mos.cms.futurecdn.net/iKwyN82wdqrkYNUhRC2EcH-1200-80.jpg",
"publishedAt": "2022-04-22T07:01:54Z",
"source": {
"name": "Tom's Guide",
"url": "https://www.tomsguide.com"
}
},
  {
    "title": "‘Give the body enough rest, but don’t let it become inactive’: Shilpa Shetty shares fitness mantra",
    "description": "\"Feeling a little sluggish or lazy may feel natural, but never give in to your body’s demands completely,\" Shilpa Shetty Kundra wrote on Instagram",
    "content": "It may seem tempting to take a few days off from your fitness routine but it is important to not give in to that temptation regularly. That’s the mantra actor and fitness aficionado Shilpa Shetty Kundra religiously follows.\nThe mother of two believes... [1572 chars]",
    "url": "https://indianexpress.com/article/lifestyle/fitness/shilpa-shetty-kundra-fitness-viparita-naukasana-7853580/",
    "image": "https://images.indianexpress.com/2022/04/shilpa-shetty-fitness_200.jpg",
    "publishedAt": "2022-04-19T04:30:06Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  }
]