[
  {
    "title": "10 healthy food swaps that will help manage blood sugar, diabetes",
    "description": "Along with lifestyle modifications and regular exercise, it is advised to add a diabetes-specific formula to your diet plan, said Dr Ganesh Kadhe",
    "content": "People with prediabetes or diabetes need to be extremely careful with their eating habits. As such, sometimes it can get tricky to ascertain which foods and drinks make for the best choices. But worry not, here are 10 picks by Dr Ganesh Kadhe, associ... [5845 chars]",
    "url": "https://indianexpress.com/article/lifestyle/health/food-swaps-manage-blood-sugar-diabetes-almonds-desserts-beans-7412348/",
    "image": "https://images.indianexpress.com/2022/01/DIABETES.jpeg",
    "publishedAt": "2022-02-09T14:53:09Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Budget 2022: Not Green, Agriculture Needs Evergreen Revolution; R&D Deserves Booster Shot",
    "description": "Budget 2022: The farming sector merits more governmental support than what is budgeted for Ministry of Agriculture and Farmers Welfare, considering the significance of healthy food and a balanced diet for immunity is much better recognised today. To double the income of farmers, there is a need for technologies that lower input costs and build resilience in farming activities.",
    "content": "Ahead of Budget 2022, agricultural reforms have again taken centre stage not only in the minds of politicians but also policymakers. To enable farmers to improve their income, they must have access to latest research and development (R&D). Record Rab... [7421 chars]",
    "url": "https://www.news18.com/news/opinion/budget-2022-not-green-indian-agriculture-needs-evergreen-revolution-research-needs-booster-shot-4665902.html",
    "image": "https://images.news18.com/ibnlive/uploads/2021/07/1627056771_paddy11-1600x900.jpg",
    "publishedAt": "2022-01-19T10:49:50Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Tata CliQ Luxury ties up with BigBasket, to forway into sustainable, organic food | INTERVIEW",
    "description": "Tata CliQ Luxury had announced its partnership with the Tata group-owned BigBasket to enter into India's gourmet food segment. The luxury platform will, in coming months, expand the assortment further with the launch of sustainable, organic, and healthy food options.",
    "content": "Tata CliQ Luxury had announced its partnership with the Tata group-owned BigBasket to enter into India’s gourmet food segment. The luxury platform will, in coming months, expand the assortment further with the launch of sustainable, organic, and heal... [3173 chars]",
    "url": "https://www.financialexpress.com/industry/tata-cliq-luxury-ties-up-with-bigbasket-to-forway-into-sustainable-organic-food-interview/2409688/",
    "image": "https://www.financialexpress.com/wp-content/uploads/2022/01/Tata-CLiQ-Luxury_Gourmet-store-powered-by-bigbasket_Image1.jpg",
    "publishedAt": "2022-01-18T12:36:07Z",
    "source": {
      "name": "The Financial Express",
      "url": "https://www.financialexpress.com"
    }
  },
  {
    "title": "Pune Inc: Startup promotes healthy food with transparency on ingredients",
    "description": "Pune news: True Elements enables consumers to trace the antecedents of their product through its traceability feature. Recently, it signed an agreement with cooperative societies and entered contract farming in Maharashtra to source clean grains.",
    "content": "You can meet the conscientious shopper in the aisles of grocery stores — picking up an item and reading the packaging before deciding on their purchase. Since the Covid-19 pandemic began, such shoppers have increased.\nA report by UK-based market rese... [4628 chars]",
    "url": "https://indianexpress.com/article/cities/pune/pune-inc-startup-promotes-healthy-food-with-transparency-on-ingredients-7705524/",
    "image": "https://images.indianexpress.com/2022/01/true-element-1.jpeg",
    "publishedAt": "2022-01-04T08:52:58Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "As Covid-19 Cases Surge, Don't Forget To Try These Asanas To Boost Your Immunity",
    "description": "Apart from consuming healthy food and drinks, it is also necessary to do regular yoga to keep yourself healthy and strong.",
    "content": "Amid the rising number of coronavirus cases in the country, people are trying different methods and medicines to increase and boost their immunity. To fight against coronavirus and other diseases, it is very important to have a healthy immune system.... [1743 chars]",
    "url": "https://www.news18.com/news/lifestyle/as-covid-19-cases-surge-dont-forget-to-try-these-asanas-to-boost-your-immunity-4619444.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/01/studio_project-10-35-164121697916x9.jpg",
    "publishedAt": "2022-01-03T13:37:25Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Study finds online menus should put healthy foods first",
    "description": "A new research has found that women who see healthy food at the top of an online menu are 30 to 40 per cent more likely to order it.",
    "content": "A new research has found that women who see healthy food at the top of an online menu are 30 to 40 per cent more likely to order it. The research, which was led by Flinders University PhD Candidate Indah Gynell, has been published in the 'Appetite Jo... [2715 chars]",
    "url": "https://www.devdiscourse.com/article/lifestyle/1852559-study-finds-online-menus-should-put-healthy-foods-first",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_12_2021_09_36_03_8731705.jpg?width=920&format=jpeg",
    "publishedAt": "2021-12-18T09:36:25Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
    "title": "List of healthy food items to eat after breaking the fast",
    "description": "Fasting on Karwa Chauth can be difficult for many as one has to abstain from drinking water. Hence it is important to watch what one eats when she breaks her fast",
    "content": "Consuming food that is rich in fats or sugar on an empty stomach can make the body feel uneasy and bloated\nKarwa Chauth one of the most auspicious and celebrated festivals in northern India. It is observed by married women, who fast on the day and pr... [2396 chars]",
    "url": "https://www.firstpost.com/india/karwa-chauth-2021-heres-your-guide-to-what-to-eat-after-breaking-your-fast-10079401.html",
    "image": "https://images.firstpost.com/wp-content/uploads/2021/05/chantal-garnier-910GanwBoew-unsplash-1.jpg",
    "publishedAt": "2021-10-24T03:42:25Z",
    "source": {
      "name": "Firstpost",
      "url": "https://www.firstpost.com"
    }
  },
  {
    "title": "Navratri fasting: Healthy food options you can try",
    "description": "Nutritionist Simran Khosla also suggested foods you need to stay away from during the nine days",
    "content": "The festival of Navratri is finally here. During the nine days, many people observe a fast. If you too are fasting and are looking for healthy options that will make you feel satiated and energetic throughout the day, here are some unbeatable foods t... [2435 chars]",
    "url": "https://indianexpress.com/article/lifestyle/food-wine/fasting-navratri-healthy-food-combinations-fibre-insulin-veg-7557684/",
    "image": "https://images.indianexpress.com/2021/10/navratri-fasting_1200_getty.jpg",
    "publishedAt": "2021-10-07T10:20:53Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "India becoming destination country for healthy food, says Tomar at G-20 Agriculture Ministers' meeting",
    "description": "Union Minister of Agriculture and Farmers Welfare, Narendra Singh Tomar on Sunday said that India is becoming a destination country for healthy food items.",
    "content": "Union Minister of Agriculture and Farmers Welfare, Narendra Singh Tomar on Sunday said that India is becoming a destination country for healthy food items. \"The Government of India has emphasised on re-introducing traditional food items including mil... [3656 chars]",
    "url": "https://www.devdiscourse.com/article/headlines/1736250-india-becoming-destination-country-for-healthy-food-says-tomar-at-g-20-agriculture-ministers-meeting",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_09_2021_17_10_41_0105203.jpg?width=920&format=jpeg",
    "publishedAt": "2021-09-19T17:11:07Z",
    "source": {
      "name": "Devdiscourse",
      "url": "https://www.devdiscourse.com"
    }
  },
  {
    "title": "How supermarkets can impact healthy food choices",
    "description": "Do you feel like buying everything you see on the supermarket shelves? Well, most of us love the way supermarkets shelves are packed with food. Accord",
    "content": "Do you feel like buying everything you see on the supermarket shelves? Well, most of us love the way supermarkets shelves are packed with food. According to a recent study by the University of Southampton shows that removing confectionery and other u... [2957 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/food-news/quirky-and-organized-supermarket-layouts-influence-customers-food-choices/articleshow/86099257.cms",
    "image": "https://static.toiimg.com/thumb/msid-86099257,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-99242/86099257.jpg",
    "publishedAt": "2021-09-11T15:31:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  }
]