[
  {
    "title": "Foods that have 10 gms and more protein",
    "description": "Here is a list of 8 such foods that are super high in protein and can provide 10 gms or more of it daily.",
    "content": "From improving the mood to helping in burning fat and toning those muscles, protein is a nutrient that’s often seen as a dude food but is something that everyone needs. It is also an essential nutrient to improve the immunity levels of a person. Thus... [602 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/food-news/foods-that-have-10-gms-and-more-protein/photostory/90735440.cms",
    "image": "https://static.toiimg.com/photo/90735498.cms",
    "publishedAt": "2022-04-09T02:30:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  {
    "title": "The Connection Between IBD and Aging",
    "description": "Inflammatory bowel disease (IBD) has long been thought of as a disease of moderate, or even young, adulthood. Chronic disease—which includes Crohn's disease",
    "content": "Inflammatory bowel disease (IBD) has long been thought of as a disease of moderate, or even young, adulthood. Chronic disease—which includes Crohn’s disease and ulcerative colitis, and can cause abdominal pain, diarrhea, bleeding, and decreased quali... [427 chars]",
    "url": "https://themiracletech.com/latest/the-connection-between-ibd-and-aging/",
    "image": "https://themiracletech.com/wp-content/uploads/2022/04/The-Connection-Between-IBD-and-Aging.jpg",
    "publishedAt": "2022-04-08T20:12:34Z",
    "source": {
      "name": "The Miracle Tech",
      "url": "https://themiracletech.com"
    }
  },
  {
    "title": "To keep your brain sharp, add THESE foods to your breakfast platter; help retain cognitive function for longevity",
    "description": "We know that the brain is the most significant and complex organ of the human body. We are also aware that certain nutrients may help to safeguard brain health. What are those foods that we can add to our daily diet so as to ensure that our brain is not starved of vital nutrients it craves?",
    "content": "Brain power: Foods that help enhance and preserve cognitive function Photo : iStock\nKEY HIGHLIGHTS What is a long and otherwise healthy life if the brain's faculties are not intact?\nA host of underlying cellular and molecular changes within the brain... [6099 chars]",
    "url": "https://www.timesnownews.com/health/to-keep-your-brain-sharp-add-these-foods-to-your-breakfast-platter-helps-retain-cognitive-function-for-longevity-article-90733370",
    "image": "https://static.tnn.in/thumb/msid-90733370,imgsize-100,width-1280,height-720,resizemode-75/90733370.jpg",
    "publishedAt": "2022-04-08T16:03:00Z",
    "source": {
      "name": "Times Now",
      "url": "https://www.timesnownews.com"
    }
  },
  {
    "title": "New Study Sheds Light on Crucial Genetic Aspect of Schizophrenia",
    "description": "The study published in Nature journal analysed DNA from 76,755 people with schizophrenia and 2,43,649 without the disorder to better understand the genes and biological processes",
    "content": "A recent study conducted by a group of hundreds of researchers across 45 countries analysing the genetic formation of schizophrenia has identified large numbers of specific genes that could play important roles in the psychiatric disorder. The study ... [2530 chars]",
    "url": "https://www.news18.com/news/lifestyle/new-study-sheds-light-on-crucial-genetic-aspect-of-schizophrenia-4954625.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/04/schizophrenia-164942461716x9.jpg",
    "publishedAt": "2022-04-08T13:30:54Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Over 80% newly diagnosed diabetic patients in India have at least one cholesterol abnormality: Study",
    "description": "The India Diabetes Study also suggested that 42 per cent of all Type 2 Diabetes patients are at a high risk of hypertension.",
    "content": "A new study shows that over 55 per cent of newly diagnosed Type 2 Diabetes Mellitus (T2DM) patients in India have low HDL-C (High Density Lipid – Cholesterol) values, indicating that they are at higher risk of developing some form of cardiovascular d... [2640 chars]",
    "url": "https://indianexpress.com/article/cities/pune/80-percent-newly-diagnosed-diabetic-patients-india-one-cholesterol-abnormality-study-7860297/",
    "image": "https://images.indianexpress.com/2022/04/diabetes-528678_1280.jpg",
    "publishedAt": "2022-04-08T13:25:15Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Use of viagra may lead to blindness: Study",
    "description": "Toronto: Regular use of viagra, used to treat erectile dysfunction, can harm your vision leaving you blind, a study has claimed. Researchers from the",
    "content": "Use of viagra may lead to blindness: Study\nBy IANS Published: Published Date - 06:26 PM, Fri - 8 April 22\nRepresentational image\nToronto: Regular use of viagra, used to treat erectile dysfunction, can harm your vision leaving you blind, a study has c... [2314 chars]",
    "url": "https://telanganatoday.com/use-of-viagra-may-lead-to-blindness-study",
    "image": "https://telanganatoday.com/wp-content/uploads/2022/04/eye-problems.jpg",
    "publishedAt": "2022-04-08T12:56:44Z",
    "source": {
      "name": "Telangana Today",
      "url": "https://telanganatoday.com"
    }
  },
  {
    "title": "Evaluating immunogenicity after BNT162b2 booster vaccination",
    "description": "Researchers assessed the levels of IgG and IgA antibodies in sera samples from healthcare workers before vaccination, after the first vaccine dose, after eight months, and after a booster shot.",
    "content": "In a recent study posted to the Research Square* preprint server, researchers assessed the levels of immunoglobulin (Ig) G and IgA antibodies in sera samples from healthcare workers (HCW) before vaccination, after the first vaccine dose, after eight ... [4896 chars]",
    "url": "https://www.news-medical.net/news/20220408/Evaluating-immunogenicity-after-BNT162b2-booster-vaccination.aspx",
    "image": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_710235_16494224133042432.jpg",
    "publishedAt": "2022-04-08T12:56:00Z",
    "source": {
      "name": "News-Medical.Net",
      "url": "https://www.news-medical.net"
    }
  },
  {
    "title": "Using Viagra Regularly Can Harm Your Vision, Leave You Blind, Claims New Study. Read Details",
    "description": "Regular use of viagra, used to treat erectile dysfunction, can harm your vision leaving you blind, a new study has claimed.",
    "content": "Toronto/New Delhi: Viagra, a drug used to treat erectile dysfunction in men, can harm your vision leaving you blind, a new study has claimed. Researchers from the University of British Columbia in Canada have found that people regularly taking the co... [2561 chars]",
    "url": "https://www.india.com/health/viagra-side-effects-latest-news-using-viagra-regularly-can-harm-your-vision-leave-you-blind-claims-new-study-erectile-dysfunction-drugs-full-details-here-5327614/",
    "image": "https://static.india.com/wp-content/uploads/2015/10/viagra.jpg",
    "publishedAt": "2022-04-08T12:55:44Z",
    "source": {
      "name": "India.com",
      "url": "https://www.india.com"
    }
  },
  {
    "title": "Malawi receives 1.9 million doses of cholera vaccines to strengthen cholera preparedness and response readiness",
    "description": "Download logo Malawi has received 1.9 million doses of Oral Cholera Vaccine (OCV) from the Global Emergency Stockpile to support the first round of the oral cholera vaccination campaign. With support from the World Health... - Social News XYZ",
    "content": "Download logo\nMalawi has received 1.9 million doses of Oral Cholera Vaccine (OCV) from the Global Emergency Stockpile to support the first round of the oral cholera vaccination campaign. With support from the World Health Organization (WHO), UNICEF, ... [3590 chars]",
    "url": "https://www.socialnews.xyz/2022/04/08/malawi-receives-1-9-million-doses-of-cholera-vaccines-to-strengthen-cholera-preparedness-and-response-readiness/",
    "image": "https://www.africa-newsroom.com/files/large/a30ea3677c92d8b",
    "publishedAt": "2022-04-08T12:12:19Z",
    "source": {
      "name": "Social News XYZ",
      "url": "https://www.socialnews.xyz"
    }
  },
  {
    "title": "STI symptoms: Smell symptoms in men and women warning of risk",
    "description": "STI SYMPTOMS often relate to substances secreted which are of unusual colour. A type of smell has also been found to be indicative of an infection with a different type for men and women.",
    "content": "We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. More info\nSTI symptoms can range... [753 chars]",
    "url": "https://www.express.co.uk/life-style/health/1593241/sti-symptoms-smell-sweat-men-women-onion-odour-gonorrhoea-trichomoniasis",
    "image": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1593241.jpg",
    "publishedAt": "2022-04-08T12:12:00Z",
    "source": {
      "name": "Express",
      "url": "https://www.express.co.uk"
    }
  }
]