[
  {
    "title": "IBD patients in remission may have Mental health issues, low productivity at work",
    "description": "Inflammatory bowel disease (IBD) is a term for two conditions (Crohn's disease and ulcerative colitis) that are characterized by chronic inflammation of the gastrointestinal (GI) tract. Chronic...",
    "content": "Inflammatory bowel disease (IBD) is a term for two conditions (Crohn's disease and ulcerative colitis) that are characterized by chronic inflammation of the gastrointestinal (GI) tract. Chronic diseases, such as Inflammatory Bowel Disease, can lead t... [2132 chars]",
    "url": "https://medicaldialogues.in/gastroenterology/news/ibd-patients-in-remission-may-have-mental-health-issues-low-productivity-at-work-91063",
    "image": "https://medicaldialogues.in/h-upload/2022/04/06/173725-ibd-and-anxiety.jpg",
    "publishedAt": "2022-04-07T00:24:44Z",
    "source": {
      "name": "Medical Dialogues",
      "url": "https://medicaldialogues.in"
    }
  },
  {
    "title": "New Study Completely Changes What We Currently Believe About Alcohol",
    "description": "While some studies have hinted at links between light alcohol consumption and heart health benefits, a new study says otherwise.",
    "content": "Previous studies have hinted at links between light alcohol consumption and benefits to people's heart health, and it's easy to run with any study that suggests that cracking open a cold one after work is actually good for you.\nHowever, the connectio... [2671 chars]",
    "url": "https://www.eatthis.com/news-alcohol-heart-health/",
    "image": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/wine-glasses.jpg?quality=82&strip=all",
    "publishedAt": "2022-04-06T21:59:58Z",
    "source": {
      "name": "Eat This, Not That",
      "url": "https://www.eatthis.com"
    }
  },
  {
    "title": "NINE new Covid symptoms are added to official NHS list",
    "description": "NINE new symptoms of Covid have been added to the official NHS list - as the number of people with the virus reaches record highs.",
    "content": "NINE new symptoms of Covid have been added to the official NHS list – as the number of people with the virus reaches record highs.\nMore than two years into the pandemic, the list of possible signs that someone might have the illness has been quietly ... [1987 chars]",
    "url": "https://centralrecorder.com/nine-new-covid-symptoms-are-added-to-official-nhs-list/",
    "image": "https://centralrecorder.com/wp-admin/admin-ajax.php?action=rank_math_overlay_thumb&id=92456&type=play",
    "publishedAt": "2022-04-06T21:50:14Z",
    "source": {
      "name": "Central Recorder",
      "url": "https://centralrecorder.com"
    }
  },
  {
    "title": "For Your Patients: What to Know About Endometriosis Treatment",
    "description": "Medical, surgical, and lifestyle approaches can help",
    "content": "You may have been diagnosed with endometriosis based on your symptoms, a pelvic exam, and/or imaging such as ultrasound. The next step is treatment, which is usually based on the severity of pain and your desire for pregnancy. Doctors have a range of... [4081 chars]",
    "url": "https://www.medpagetoday.com/medical-journeys/endometriosis/97963",
    "image": "https://assets.medpagetoday.net/media/images/97xxx/97963.png",
    "publishedAt": "2022-04-06T21:19:57Z",
    "source": {
      "name": "Medpage Today",
      "url": "https://www.medpagetoday.com"
    }
  },
  {
    "title": "Superfood for children for sharper brains; Here's diet chart for kids suggested by Swami Ramdev",
    "description": "These act as a tool for calming and energizing the child to develop a state-of-relaxed mind, which is crucial for learning. It also develops social-emotional awareness, body awareness and coordination, and interpersonal skills.",
    "content": "Follow us on Image Source : FREEPIK Representative image\nWith increasing competition in every field, children are often under immense pressure to perform well. In such a situation it is very important to keep in mind the well-being of both physical a... [1241 chars]",
    "url": "https://www.indiatvnews.com/health/superfood-for-children-for-sharper-brains-diet-chart-for-kids-suggested-by-swami-ramdev-2022-04-04-767639",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/kids-1649067469.jpg",
    "publishedAt": "2022-04-04T10:19:58Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Alarming rise in pre-diabetics among young: Data analysis",
    "description": "Medall’s data analysis on results of tests held from 2017 at centres across South India shows an increasing trend in prevalence of obesity and diabetes",
    "content": "Hyderabad: An alarming increase in percentage of pre-diabetes among younger age groups was found by Medall's data analysis on results of tests from 2017 at centres across South India. The data also shows an increasing trend in the prevalence of obesi... [1700 chars]",
    "url": "https://www.thehansindia.com/news/cities/hyderabad/alarming-rise-in-pre-diabetics-among-young-data-analysis-736882",
    "image": "https://assets.thehansindia.com/h-upload/2022/04/06/1285574-diabets.jpg",
    "publishedAt": "2022-04-06T19:05:41Z",
    "source": {
      "name": "The Hans India",
      "url": "https://www.thehansindia.com"
    }
  },
  {
    "title": "'XE variant of Covid-19 unlikely to create much impact in Telangana'",
    "description": "The hybrid recombinant strains of SARS-CoV-2 including XE, which was reported in Mumbai on Wednesday, XD and XF, are unlikely to create much impact",
    "content": "‘XE variant of Covid-19 unlikely to create much impact in Telangana’\nBy M. Sai Gopal Published: Updated On - 12:24 AM, Thu - 7 April 22\nRepresentational Image\nHyderabad: The hybrid recombinant strains of SARS-CoV-2 including XE, which was reported in... [2620 chars]",
    "url": "https://telanganatoday.com/xe-variant-of-covid-19-unlikely-to-create-much-impact-in-telangana",
    "image": "https://telanganatoday.com/wp-content/uploads/2022/04/COVID.jpeg",
    "publishedAt": "2022-04-06T18:45:11Z",
    "source": {
      "name": "Telangana Today",
      "url": "https://telanganatoday.com"
    }
  },
  {
    "title": "Do you need to eat meat to get protein?",
    "description": "Are you wondering, do you need to eat meat to get protein into your diet? Discover alternative sources of protein, from plant-based to powder supplements",
    "content": "Do you need to eat meat to get protein into your diet? Protein is an essential building block that helps our body to grow and function. Most of us already know that eating meat and poultry is an easy way to get more of it into our diet\nHere, we’ll be... [5894 chars]",
    "url": "https://www.livescience.com/do-you-need-to-eat-meat-to-get-protein",
    "image": "https://cdn.mos.cms.futurecdn.net/AyYw4skQeVcpx8PXcWmNfL-1200-80.jpg",
    "publishedAt": "2022-04-06T15:36:30Z",
    "source": {
      "name": "Livescience.com",
      "url": "https://www.livescience.com"
    }
  },
  {
    "title": "Prevention is better than cure, and is cheaper too!",
    "description": "Prevention is better than cure, and is cheaper too! This is an old adage that signifies the importance of taking precautionary steps to prevent a problem",
    "content": "Prevention is better than cure, and is cheaper too!\nThis is an old adage that signifies the importance of taking precautionary steps to prevent a problem from happening rather than fixing it after it occurs. It is a fundamental principle of healthcar... [5809 chars]",
    "url": "https://www.mangalorean.com/prevention-is-better-than-cure-and-is-cheaper-too/",
    "image": "https://www.mangalorean.com/wp-content/uploads/2022/04/Prevention-is-better-than-cure-and-is-cheaper-too.jpg",
    "publishedAt": "2022-04-06T14:42:18Z",
    "source": {
      "name": "Mangalorean.com",
      "url": "https://www.mangalorean.com"
    }
  },
  {
    "title": "Study on genetic risk for Alzheimer’s discovers 42 previously-unknown genes linked to the disease",
    "description": "Researchers said that \"with multiple triggers, biological pathways and cell types involved in its development\", Alzheimer’s disease is \"an extremely complex condition\".",
    "content": "As many as 42 previously undiscovered genes have been found to have a link with the development of Alzheimer’s disease in the largest ever study of genetic risk for Alzheimer’s, a CNN report states.\nAccording to the report, in addition to the APOE e4... [2900 chars]",
    "url": "https://indianexpress.com/article/lifestyle/health/study-genetic-risk-alzheimers-42-unknown-genes-linked-disease-7855956/",
    "image": "https://images.indianexpress.com/2022/04/GettyImages-brain-health-alzheimers-1200.jpg",
    "publishedAt": "2022-04-06T14:30:09Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  }
]