[
  {
    "title": "Here's How On This Day In 1984, American Scientist Disclosed AIDS Virus And Made A Premature Promise",
    "description": "The discovery of a virus which causes AIDS has been hailed as a \"monumental breakthrough\" in the history of medical research. The development was first announced in Washington by US Health Secretary...",
    "content": "HIV (human immunodeficiency virus) has been one of the most sobering public health challenges the humanity has ever faced. According to the World Health Organisation (WHO), 79.3 million [55.9–110 million] people have been infected with HIV since the ... [1884 chars]",
    "url": "https://thelogicalindian.com/history/on-this-day-in-1984-american-scientist-disclosed-aids-virus-35164",
    "image": "https://thelogicalindian.com/h-upload/2022/04/23/215781-untitled-design-2022-04-23t144209024.jpg",
    "publishedAt": "2022-04-23T09:25:28Z",
    "source": {
      "name": "The Logical Indian",
      "url": "https://thelogicalindian.com"
    }
  },
  {
    "title": "New lab grown mini heart chamber may help speed heart disease cures",
    "description": "New York, April 23 (SocialNews.XYZ) US researchers have engineered a tiny living heart chamber replica that may help to more accurately mimic the real organ and provide a sandbox for testing new heart disease treatments.... - Social News XYZ",
    "content": "New York, April 23 (SocialNews.XYZ) US researchers have engineered a tiny living heart chamber replica that may help to more accurately mimic the real organ and provide a sandbox for testing new heart disease treatments.\nThe miniature replica was bui... [3118 chars]",
    "url": "https://www.socialnews.xyz/2022/04/23/new-lab-grown-mini-heart-chamber-may-help-speed-heart-disease-cures/",
    "image": "https://boxoffice.socialnews.xyz/get_ians_img.php.jpg?id=C-1-1466320&txt=New+lab+grown+mini+heart+chamber+may+help+speed+heart+disease+cures",
    "publishedAt": "2022-04-23T09:22:01Z",
    "source": {
      "name": "Social News XYZ",
      "url": "https://www.socialnews.xyz"
    }
  },
  {
    "title": "How our immune system is linked with long Covid",
    "description": "US researchers have found that an abnormally suppressed immune system may be to blame for long Covid-19 and not a persistently hyperactive",
    "content": "This is generally classified as long Covid, although symptoms vary widely and this syndrome is probably not a single disease entity. Limited understanding of its causes, however, makes finding ways to treat the condition particularly difficult.\nMany ... [1962 chars]",
    "url": "https://telanganatoday.com/how-our-immune-system-is-linked-with-long-covid",
    "image": "https://cdn.telanganatoday.com/wp-content/uploads/2022/02/cropped-android-chrome-512x512-1-267x267-2.png",
    "publishedAt": "2022-04-23T06:49:20Z",
    "source": {
      "name": "Telangana Today",
      "url": "https://telanganatoday.com"
    }
  },
  {
    "title": "Irritable Bowel Syndrome Grows More Complicated During Pregnancy, Know How",
    "description": "IBS is common during pregnancy due to the extreme hormonal changes, stress and the pressure of growing a baby inside the uterus on the stomach and intestines.",
    "content": "Irritable Bowel Syndrome (IBS) is a disorder that affects the large intestine. While most people can manage the syndrome through lifestyle and diet changes, some do suffer from severe symptoms and signs. Some of the symptoms of IBS are abdominal pain... [2203 chars]",
    "url": "https://www.news18.com/news/lifestyle/irritable-bowel-syndrome-grows-more-complicated-during-pregnancy-know-how-5020741.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/04/untitled-2-11-164950855316x9.jpg",
    "publishedAt": "2022-04-23T05:49:01Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Scientists find how Omicron sub variants escape immune system, spread",
    "description": "Scientists in the US have found the mechanism which the BA.1 and BA.2 Omicron sub variants use to escape antibodies and spread rapidly.",
    "content": "Houston: Scientists in the US have found the mechanism which the BA.1 and BA.2 Omicron sub variants use to escape antibodies and spread rapidly, an advance that could lead to new therapeutic targets and help update COVID-19 vaccine formulations.\nThe ... [3221 chars]",
    "url": "https://www.eastmojo.com/news/2022/04/23/scientists-find-how-omicron-sub-variants-escape-immune-system-spread/",
    "image": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/07/coronavirus_4833754_1920-9.jpg?fit=1536%2C768&ssl=1",
    "publishedAt": "2022-04-23T03:50:00Z",
    "source": {
      "name": "EastMojo",
      "url": "https://www.eastmojo.com"
    }
  },
  {
    "title": "Foetal exposure to medicines can affect brain development of infants: Study",
    "description": "Pregnant mothers may need treatment for their medical conditions, such as mood disorders or epilepsy. | Health",
    "content": "A new study demonstrates that in utero exposure to mother's antiepileptic or antidepressant medication may affect the development of the newborn brain networks.\nIn the study by the University of Helsinki, novel mathematical methods were developed to ... [3131 chars]",
    "url": "https://www.hindustantimes.com/lifestyle/health/foetal-exposure-to-medicines-can-affect-brain-development-of-infants-study-101650685094488.html",
    "image": "https://images.hindustantimes.com/img/2022/04/23/1600x900/_0aec6028-1376-11eb-9315-b00ef9141a48_1650685187388.jpg",
    "publishedAt": "2022-04-23T03:41:39Z",
    "source": {
      "name": "Hindustan Times",
      "url": "https://www.hindustantimes.com"
    }
  },
  {
    "title": "Vision improvement is long-lasting with treatment of retinal vein occlusion",
    "description": "New research shows that a treatment for retinal vein occlusion yields long-lasting vision gains, with visual acuity remaining significantly above baseline at five years. However, many patients require...",
    "content": "New research shows that a treatment for retinal vein occlusion yields long-lasting vision gains, with visual acuity remaining significantly above baseline at five years. However, many patients require ongoing treatment. Retinal vein occlusion is one ... [3663 chars]",
    "url": "https://medicaldialogues.in/ophthalmology/news/vision-improvement-is-long-lasting-with-treatment-of-retinal-vein-occlusion-91838",
    "image": "https://medicaldialogues.in/h-upload/2022/04/22/174814-ophthalmology.jpg",
    "publishedAt": "2022-04-23T03:30:43Z",
    "source": {
      "name": "Medical Dialogues",
      "url": "https://medicaldialogues.in"
    }
  },
  {
    "title": "Longer gap between Covid vaccine doses generates higher antibodies: Study",
    "description": "A longer interval between the first two doses of the COVID-19 vaccine may boost antibody levels up to nine-fold, according to a study conducted in the UK.",
    "content": "London: A longer interval between the first two doses of the COVID-19 vaccine may boost antibody levels up to nine-fold, according to a study conducted in the UK.\nThe finding by researchers at the UK Health Security Agency (UKHSA) also suggests that ... [3287 chars]",
    "url": "https://www.eastmojo.com/news/2022/04/23/longer-gap-between-covid-vaccine-doses-generates-higher-antibodies-study/",
    "image": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/01/Covid-lab.jpg?fit=1280%2C854&ssl=1",
    "publishedAt": "2022-04-23T03:00:00Z",
    "source": {
      "name": "EastMojo",
      "url": "https://www.eastmojo.com"
    }
  },
  {
    "title": "New Technology Rapidly Measures Blocking Ability of Antibodies Against COVID-19, Variants: Study",
    "description": "Through a new study, researchers have developed a pseudovirus system that can quantify the ability of one's antibodies to neutralize the SARS-CoV-2 virus and its variants.",
    "content": "The debate of whether one's antibodies can prevent the SARS-CoV-2 virus from infecting their body has been an unsettled one. Also, the question of whether prior infection with COVID-19 can offer protection against multiple variants remains inconclusi... [4061 chars]",
    "url": "https://www.ibtimes.co.in/new-technology-rapidly-measures-blocking-ability-antibodies-against-covid-19-variants-study-847740",
    "image": "https://data1.ibtimes.co.in/en/full/759908/sars-cov-2-coronavirus.jpg",
    "publishedAt": "2022-04-22T18:29:08Z",
    "source": {
      "name": "IBTimes India",
      "url": "https://www.ibtimes.co.in"
    }
  },
  {
    "title": "Diabetes: Top 7 tips for healthy eating to keep blood sugar normal",
    "description": "Yes, we agree that diabetes is not a good disorder to have. But if you can control your diet and fit in some regular exercise, it is mostly a manageable condition. There are different types of diabetes, so there isn’t a one-size-fits-all way of eating. Here are tips that you can use to help you make healthier food choices.",
    "content": "Diabetes and food choices to control blood sugar Photo : iStock\nDiabetes is a health condition that affects the blood sugar levels and left unattended can affect the vital organs of the body.\nType 1 Diabetes is autoimmune and Type 2 is mostly (not al... [464 chars]",
    "url": "https://www.timesnownews.com/health/diabetes-top-7-tips-for-healthy-eating-to-keep-blood-sugar-normal-article-91013290",
    "image": "https://static.tnn.in/thumb/msid-91013290,imgsize-100,width-1280,height-720,resizemode-75/91013290.jpg",
    "publishedAt": "2022-04-22T18:29:00Z",
    "source": {
      "name": "Times Now",
      "url": "https://www.timesnownews.com"
    }
  }
]