[
  {
    "title": "Lithium Treatment decreases Osteoporosis risk in Patients with Bipolar Disorder: JAMA study",
    "description": "A new study published in the Journal of American Medical Association shows that bipolar disorder was linked to an increase in the risk of osteoporosis, whereas lithium therapy was linked to a decrease...",
    "content": "A new study published in the Journal of American Medical Association shows that bipolar disorder was linked to an increase in the risk of osteoporosis, whereas lithium therapy was linked to a decrease in the risk of osteoporosis.\nOsteoporosis, a syst... [2709 chars]",
    "url": "https://medicaldialogues.in/psychiatry/news/lithium-treatment-decreases-osteoporosis-risk-in-patients-with-bipolar-disorder-jama-study-90767",
    "image": "https://medicaldialogues.in/h-upload/2021/02/23/148407-osteoporosis.jpg",
    "publishedAt": "2022-03-31T14:07:16Z",
    "source": {
      "name": "Medical Dialogues",
      "url": "https://medicaldialogues.in"
    }
  },
  {
    "title": "Want to Avoid Abdominal Fat? Sleep Better",
    "description": "Visceral fat is deposited deep inside the abdomen around internal organs linked to cardiac and metabolic diseases.",
    "content": "New research from Mayo Clinic has found that lack of sleep combined with free access to food increases calorie consumption and consequently fat accumulation, especially unhealthy fat inside the belly. The findings of the research were published in th... [4002 chars]",
    "url": "https://www.news18.com/news/lifestyle/want-to-avoid-abdominal-fat-sleep-better-4929467.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/03/untitled-design-11-19-164828139916x9.png",
    "publishedAt": "2022-03-31T13:03:46Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "COVID-19 reinfection risk lowest in children: Lancet",
    "description": "UK: Children had a lower risk of reinfection with COVID-19 than did adults, but reinfections were not linked with more severe disease or fatality, says a recent study in Lancet Child & Adolescent...",
    "content": "UK: Children had a lower risk of reinfection with COVID-19 than did adults, but reinfections were not linked with more severe disease or fatality, says a recent study in Lancet Child & Adolescent Health. From 2020 to July 2021, the reinfection rate w... [3462 chars]",
    "url": "https://medicaldialogues.in/pediatrics-neonatology/news/covid-19-reinfection-risk-lowest-in-children-lancet-90748",
    "image": "https://medicaldialogues.in/h-upload/2022/03/31/173255-covid-19-in-children.jpg",
    "publishedAt": "2022-03-31T10:08:55Z",
    "source": {
      "name": "Medical Dialogues",
      "url": "https://medicaldialogues.in"
    }
  },
  {
    "title": "Living Donor Transplant improves survival in CRC patients With Liver-Only Metastases",
    "description": "Toronto - Living Donor Transplant improves survival in CRC patients With Liver-Only Metastases, finds a new study. Such patients with unresectable colorectal cancer liver metastases (CRLMs) had better...",
    "content": "Toronto - Living Donor Transplant improves survival in CRC patients With Liver-Only Metastases, finds a new study. Such patients with unresectable colorectal cancer liver metastases (CRLMs) had better survival outcomes following total hepatectomy and... [4260 chars]",
    "url": "https://medicaldialogues.in/surgery/news/living-donor-transplant-improves-survival-in-crc-patients-with-liver-only-metastases-90741",
    "image": "https://medicaldialogues.in/h-upload/2022/03/31/173209-untitled-design-28.jpg",
    "publishedAt": "2022-03-31T09:30:04Z",
    "source": {
      "name": "Medical Dialogues",
      "url": "https://medicaldialogues.in"
    }
  },
  {
    "title": "Researchers shed light on psychological therapies for chronic low back pain",
    "description": "Adults with chronic low back pain (lasting for more than 12 weeks) not only experience physical disability but can also suffer psychological distress in the form of anxiety, depression and fear avoidance (avoiding movement for fear of pain). | Health",
    "content": "Researchers from the University of Sydney, Australia suggested that a combination of physiotherapy alongside psychological interventions are more effective for improving physical function and pain intensity.\nThe clinical study published in BMJ can he... [4340 chars]",
    "url": "https://www.hindustantimes.com/lifestyle/health/researchers-shed-light-on-psychological-therapies-for-chronic-low-back-pain-101648716647257.html",
    "image": "https://images.hindustantimes.com/img/2022/03/31/1600x900/back_pain_thumb_1645447132608_1648716693292.jpg",
    "publishedAt": "2022-03-31T08:53:03Z",
    "source": {
      "name": "Hindustan Times",
      "url": "https://www.hindustantimes.com"
    }
  },
  {
    "title": "Scientists distinguish between treatable, untreatable sudden cardiac arrest",
    "description": "The findings, published in the peer-reviewed Journal of the American College of Cardiology: Clinical Electrophysiology, have the potential to enhance prevention of sudden cardiac arrest -- unexpected loss of heart function -- based on key risk factors identified in this study.",
    "content": "Scientists in the Smidt Heart Institute at Cedars-Sinai developed a clinical algorithm that distinguishes between treatable sudden cardiac arrest and untreatable forms of the condition.\nThe findings, published in the peer-reviewed Journal of the Amer... [3330 chars]",
    "url": "https://www.hindustantimes.com/science/scientists-distinguish-between-treatable-untreatable-sudden-cardiac-arrest-101648715193265.html",
    "image": "https://images.hindustantimes.com/img/2022/03/31/1600x900/6aaefd0a-a933-11ec-9297-ed70bb26c8ff_1647880144610_1648715999962.jpg",
    "publishedAt": "2022-03-31T08:40:35Z",
    "source": {
      "name": "Hindustan Times",
      "url": "https://www.hindustantimes.com"
    }
  },
  {
    "title": "2 Servings of Avocados a Week Can Lower The Risk of Cardiovascular Disease",
    "description": "Avocados contain dietary fibre, unsaturated fats especially monounsaturated fat (healthy fats) and other favourable components that have been associated with good cardiovascular health.",
    "content": "A new study has suggested that eating two or more servings of avocado weekly was associated with a lower risk of cardiovascular disease. The study was published in ‘Journal of the American Heart Association’.\nAvocados contain dietary fibre, unsaturat... [4179 chars]",
    "url": "https://www.news18.com/news/lifestyle/2-servings-of-avocados-a-week-can-lower-risk-of-cardiovascular-disease-4927712.html",
    "image": "https://images.news18.com/ibnlive/uploads/2021/11/untitled-design-2021-11-10t124614.662-163653033916x9.jpg",
    "publishedAt": "2022-03-31T07:55:00Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Covid Vaccines Did Not Protect Adolescents as Effectively During the Omicron Surge",
    "description": "While any hospitalization is unnerving, it is reassuring that the vaccines still protected children from the worst outcomes of infection, said Dr Manish Patel said.",
    "content": "In yet another twist to the debate over how best to protect children against the coronavirus, researchers reported Wednesday that COVID vaccines conferred diminished protection against hospitalization among children 12 and older during the latest omi... [7089 chars]",
    "url": "https://www.news18.com/news/world/covid-vaccines-did-not-protect-adolescents-as-effectively-during-the-omicron-surge-4926863.html",
    "image": "https://images.news18.com/ibnlive/uploads/2021/11/pfizer-covid-vaccine-children-kids-163733927216x9.jpg",
    "publishedAt": "2022-03-31T07:49:57Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "Impact of Covid-19 in children: Vaccination schedules",
    "description": "The coronavirus disease (COVID-19) pandemic has led to significant interruptions in immunisation programmes globally alongside the disruption of other routine health services.",
    "content": "A large study that was conducted recently showed in different countries showed that the most common reason for missed childhood vaccination was getting affected by COVID-19 at the vaccination clinic (15%). Other reasons for missed vaccination include... [2963 chars]",
    "url": "https://indianexpress.com/article/parenting/sponsored-parenting/impact-of-covid19-in-children-vaccination/",
    "image": "https://images.indianexpress.com/2022/03/IE_Lead_16.jpg",
    "publishedAt": "2022-03-31T07:45:57Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Living donor liver transplant viable option for colorectal cancer patients",
    "description": "A study published in the Journal of the American Medical Association Surgery today is the first in North America to demonstrate that living-donor liver",
    "content": "A study published in the Journal of the American Medical Association Surgery today is the first in North America to demonstrate that living-donor liver transplant is a viable option for patients who have systemically controlled colorectal cancer and ... [2749 chars]",
    "url": "https://eturbonews.com/3064475/living-donor-liver-transplant-viable-option-for-colorectal-cancer-patients/",
    "image": "https://eturbonews.com/wp-content/uploads/2022/03/A-HOLD-FreeRelease-8.jpg",
    "publishedAt": "2022-03-31T04:03:09Z",
    "source": {
      "name": "eTurboNews | TravelWireNews",
      "url": "https://eturbonews.com"
    }
  }
]