[
  {
    "title": "Obesity and menopausal age are related to heart failure explored",
    "description": "The risk for heart failure is increased with increasing body mass index and waist circumference, especially for those with menopausal age 55 years or",
    "content": "The risk for heart failure is increased with increasing body mass index and waist circumference, especially for those with menopausal age 55 years or older, according to a study published online April 13 in the Journal of the American Heart Associati... [1509 chars]",
    "url": "https://www.bollyinside.com/news/obesity-and-menopausal-age-are-related-to-heart-failure-explored",
    "image": "https://www.bollyinside.com/wp-content/uploads/2022/03/default-bollyinside.png",
    "publishedAt": "2022-04-14T12:52:18Z",
    "source": {
      "name": "BollyInside",
      "url": "https://www.bollyinside.com"
    }
  },
  
  {
    "title": "Does high cholesterol run in your family? Inculcate these habits for a healthier life",
    "description": "On one hand, there are some people whose LDL levels skyrocket due to their dietary and lifestyle choices like excess intake of saturated and trans fats, lack of exercise, high intake of sugar, alcohol, and smoking; there are others who genetically have high cholesterol levels.",
    "content": "Cholesterol is a waxy substance found in the blood that helps build cell membranes. Photo : iStock\nKEY HIGHLIGHTS Salmon, walnuts, flaxseeds, and leafy greens are all rich sources of omega-3 fatty acids – a nutrient that helps manage cholesterol. Thi... [3456 chars]",
    "url": "https://www.timesnownews.com/health/does-high-cholesterol-run-in-your-family-inculcate-these-habits-for-a-healthier-life-article-90847116",
    "image": "https://static.tnn.in/thumb/msid-90847116,imgsize-100,width-1280,height-720,resizemode-75/90847116.jpg",
    "publishedAt": "2022-04-14T11:46:00Z",
    "source": {
      "name": "Times Now",
      "url": "https://www.timesnownews.com"
    }
  },
  {
    "title": "New Nanoparticle-Based Rapid Covid-19 Test Is More Sensitive, Durable",
    "description": "The gold standard test for COVID-19 diagnosis remains the reverse transcription-polymerase chain reaction (RT-PCR). Although this test is highly sensitive and specific, it generally takes 1-2 days to get a result, is expensive and requires special lab equipment and trained personnel.",
    "content": "Scientists have developed a more sensitive and durable rapid COVID-19 test that uses polymer nanoparticles, rather than antibodies, to detect the SARS-CoV-2 virus. Rapid antigen tests can quickly and conveniently tell a person that they are positive ... [2337 chars]",
    "url": "https://www.cnbctv18.com/healthcare/new-nanoparticle-based-rapid-covid-19-test-is-more-sensitive-durable-13157502.htm",
    "image": "https://images.cnbctv18.com/wp-content/uploads/2021/05/rapidantigentest_RATtest2-1019x573.jpg",
    "publishedAt": "2022-04-14T10:55:00Z",
    "source": {
      "name": "CNBCTV18",
      "url": "https://www.cnbctv18.com"
    }
  },
  
  {
    "title": "Explained: What is Zika and why it could cause the next pandemic according to WHO",
    "description": "Fears around Zika primarily involve microcephaly, especially when pregnant women are infected.",
    "content": "The US researchers have found that the Zika virus can mutate to become more infective and potentially breakthrough pre-existing immunity. The finding is in line with the warning issued by the World Health Organisation (WHO), earlier this month. The g... [3380 chars]",
    "url": "https://www.news9live.com/health/explained-what-is-zika-and-why-it-could-be-the-next-pandemic-according-to-who-164667",
    "image": "https://media.news9live.com/h-upload/2022/04/14/297399-mosquito-49141128011zon11zon.jpg",
    "publishedAt": "2022-04-14T10:32:07Z",
    "source": {
      "name": "News9 LIVE",
      "url": "https://www.news9live.com"
    }
  },
  {
    "title": "5 Ingredients a Multivitamin Should Have, According to Expert",
    "description": "A multivitamin is a preparation intended to serve as a dietary supplement with vitamins, dietary minerals, and other nutritional elements. 5 Ingredients a Multivitamin Should Have, According to Expert",
    "content": "A multivitamin is a preparation intended to serve as a dietary supplement with vitamins, dietary minerals, and other nutritional elements. A multivitamin supplement is defined as a supplement containing three or more vitamins and minerals that do not... [2688 chars]",
    "url": "https://www.india.com/health/5-ingredients-a-multivitamin-should-have-according-to-expert-5338038/",
    "image": "https://static.india.com/wp-content/uploads/2022/04/pexels-anna-shvets-3683101.jpg",
    "publishedAt": "2022-04-14T11:52:41Z",
    "source": {
      "name": "India.com",
      "url": "https://www.india.com"
    }
  },
  {
    "title": "Having Covid-like symptoms? It could be regular flu or even heat-related illness",
    "description": "Burning heat waves in various parts of the country during the ongoing pandemic often cause a lot of complications.",
    "content": "If there was a common fever or cold or cough before the coronavirus arrived, we wouldn’t take it seriously thinking that it would get better after some time. But with the increasing severity of the Covid-19, we are now more concerned with the disease... [1918 chars]",
    "url": "https://www.news18.com/news/lifestyle/having-covid-like-symptoms-it-could-be-regular-flu-or-even-heat-related-illness-4974985.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/02/covid-shutterstock-representative_1622644309-164403774216x9.jpg",
    "publishedAt": "2022-04-14T10:23:35Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  },
  {
    "title": "IBS Vs IBD: Types, Causes, Symptoms and Diagnosis",
    "description": "People often confuse between IBS and IBD and use the medical terms for one another. This article will educate you about the two conditions in detail.",
    "content": "People suffering from gastrointestinal problems get to hear a lot about terms like IBS and IBD which often confuses them and is used interchangeably. These two conditions are completely different along with their causes and symptoms.\nIBD or Inflammat... [455 chars]",
    "url": "https://www.thequint.com/fit/irritable-bowel-syndrome-vs-inflammatory-bowel-disease-causes-symptoms-diagnosis-and-treatment",
    "image": "https://images.thequint.com/thequint%2F2022-04%2F1033ea27-6a44-4378-ae51-b0800e16bea3%2Fvector_of_a_woman_with_stomach_pain_on_blue_background_vector_id1167723750.jpg?w=1200&auto=format%2Ccompress&ogImage=true",
    "publishedAt": "2022-04-14T09:04:14Z",
    "source": {
      "name": "The Quint",
      "url": "https://www.thequint.com"
    }
  },
  {
    "title": "Man spends 3 days in ICU due to spontaneous pneumomediastinum - rare lung injury developed post masturbation",
    "description": "The Sun has published the medical case of a man who was left in intensive care after he suffered a rare injury from masturbating. The medics were stunned as the symptoms he manifested were of a lung injury – usually caused by coughing fits or rigorous exercise.",
    "content": "Man suffers spontaneous pneumomediastinum after masturbation and is admitted to ICU Photo : iStock\nKEY HIGHLIGHTS In a shocking turn of events, a man suffered a rare form of injury from masturbating.\nThe case that took doctors three days to diagnose ... [3798 chars]",
    "url": "https://www.timesnownews.com/health/man-spends-3-days-in-icu-due-to-spontaneous-pneumomediastinum-rare-lung-injury-developed-post-masturbation-article-90841796",
    "image": "https://static.tnn.in/thumb/msid-90841796,imgsize-100,width-1280,height-720,resizemode-75/90841796.jpg",
    "publishedAt": "2022-04-14T08:24:00Z",
    "source": {
      "name": "Times Now",
      "url": "https://www.timesnownews.com"
    }
  },
  {
    "title": "Recurrent urinary tract infection and beneficial role of probiotics: Review",
    "description": "Recurrent urinary tract infection (rUTI) is defined as the occurrence of at least 3 episodes of UTI within the last 12 months or at least 2 episodes within the last 6 months (1). Statistics highlight...",
    "content": "Recurrent urinary tract infection (rUTI) is defined as the occurrence of at least 3 episodes of UTI within the last 12 months or at least 2 episodes within the last 6 months (1). Statistics highlight that approximately one-third of all women have had... [9814 chars]",
    "url": "https://medicaldialogues.in/obstetrics-gynaecology/perspective/recurrent-urinary-tract-infection-and-beneficial-role-of-probiotics-review-91426",
    "image": "https://medicaldialogues.in/h-upload/2022/04/14/174270-editorial-client-article-1500-960px.jpg",
    "publishedAt": "2022-04-14T07:28:53Z",
    "source": {
      "name": "Medical Dialogues",
      "url": "https://medicaldialogues.in"
    }
  },
  {
    "title": "Vaccination greatly lowers infectious viral load in Covid patients: Study",
    "description": "Getting vaccinated against COVID-19 may significantly lower infectious viral load in people infected with the SARS-CoV-2, according to a study. The researchers noted that measuring the viral load of people infected with SARS-CoV-2 is one of the main factors in evaluating the infectiousness of COVID-19 patients. Viral load can be influenced by the infecting SARS-CoV-2 variant",
    "content": "Getting vaccinated against COVID-19 may significantly lower infectious viral load in people infected with the SARS-CoV-2, according to a study.\nThe researchers noted that measuring the viral load of people infected with SARS-CoV-2 is one of the main ... [3120 chars]",
    "url": "https://www.deccanherald.com/science-and-environment/vaccination-greatly-lowers-infectious-viral-load-in-covid-patients-study-1100666.html",
    "image": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/04/14/vaccination-booster-dose-pti-1100666-1649921202.jpg",
    "publishedAt": "2022-04-14T07:19:01Z",
    "source": {
      "name": "Deccan Herald",
      "url": "https://www.deccanherald.com"
    }
  }
]