[
  {
"title": "National Safe Motherhood Day 2022: Do's and Don'ts for New Moms",
"description": "National Safe Motherhood Day is observed on the 11th of April every year. The day is marked to raise awareness about antenatal care, skilled care during childbirth and postnatal care for mothers and newborns. The aim is to eradicate maternal mortality and improve maternal and newborn health.",
"content": "National Safe Motherhood Day is observed on the 11th of April every year. The day is marked to raise awareness about antenatal care, skilled care during childbirth and postnatal care for mothers and newborns. The aim is to eradicate maternal mortalit... [1908 chars]",
"url": "https://www.news18.com/news/lifestyle/national-safe-motherhood-day-2022-dos-and-donts-for-new-moms-4958984.html",
"image": "https://images.news18.com/ibnlive/uploads/2022/04/pregnant-164960974316x9.jpg",
"publishedAt": "2022-04-11T01:45:34Z",
"source": {
"name": "News18",
"url": "https://www.news18.com"
}
},
  {
    "title": "Artificial sweeteners may do you no good, could harm the liver’s ability to detoxify",
    "description": "The study, led by a team at the Medical College of Wisconsin in the US, examined two sugar substitutes - acesulfame potassium and sucralose - also known as non-nutritive sweeteners, and provide a sweet taste with few or no calories.",
    "content": "Intake of zero-sugar food and beverages like yoghurt and diet soda may not be good for health as projected as they can impair your liver's ability to flush out toxins, according to a study. Photo : iStock\nNew York: Intake of zero-sugar food and bever... [2492 chars]",
    "url": "https://www.timesnownews.com/health/artificial-sweeteners-may-do-you-no-good-could-harm-the-livers-ability-to-detoxify-article-90768790",
    "image": "https://static.tnn.in/thumb/msid-90768790,imgsize-100,width-1280,height-720,resizemode-75/90768790.jpg",
    "publishedAt": "2022-04-11T01:07:00Z",
    "source": {
      "name": "Times Now",
      "url": "https://www.timesnownews.com"
    }
  },
  {
    "title": "Covid vaccines working against all variants but may have to update if needed, says WHO chief scientist",
    "description": "Addressing a query on the future of Covid-19 and the new normal, Dr Swaminathan said that there is a possibility of the disease becoming endemic.",
    "content": "Covid vaccines are working against all variants of SARS-CoV2 virus in preventing severe disease and death. However, we may have to redesign our vaccines to adapt to new variants, Dr Soumya Swaminathan, chief scientist with World Health Organisation (... [3791 chars]",
    "url": "https://indianexpress.com/article/cities/pune/covid-19-vaccines-variants-sars-cov2-virus-who-dr-soumya-swaminathan-7862831/",
    "image": "https://images.indianexpress.com/2020/09/swamy.jpg",
    "publishedAt": "2022-04-10T23:02:57Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Protection against COVID infection improves, but wanes quickly, after 4th vaccine dose: study",
    "description": "While the fourth dose of the vaccine was found to be effective against COVID-19 infection, protection appears to be short-lived.",
    "content": "(The Hill) – A new study in Israel has found that the fourth dose of the Pfizer-BioNTech COVID-19 vaccine improves protection against infection and severe COVID-19; however, protection against confirmed infection appears to be short-lived.\nThe study,... [1422 chars]",
    "url": "https://www.wowktv.com/news/health/coronavirus/protection-against-covid-infection-improves-but-wanes-quickly-after-4th-vaccine-dose-study/",
    "image": "https://www.wowktv.com/wp-content/uploads/sites/52/2022/04/b419aa43d85a405683afb2d79195f9c3-1-1-2.jpg?w=1280",
    "publishedAt": "2022-04-10T22:00:00Z",
    "source": {
      "name": "WOWK 13 News",
      "url": "https://www.wowktv.com"
    }
  },
  {
    "title": "Covid, what scenario for next winter? “It will steal the place of the flu”",
    "description": "Fabrizio Pregliasco \"Omicron 2, if on the one hand it has interrupted that sudden decline that we were seeing in the fourth wave, on the other hand it is doing a job, albeit dirty: being so widespread, it basically makes natural boosters for vaccinated people who become infected and throws the ball in forward. In",
    "content": "“Omicron 2, if on the one hand it has interrupted that sudden decline that we were seeing in the fourth wave, on the other hand it is doing a job, albeit dirty: being so widespread, it basically makes natural boosters for vaccinated people who become... [2247 chars]",
    "url": "https://d1softballnews.com/covid-what-scenario-for-next-winter-it-will-steal-the-place-of-the-flu/",
    "image": "https://immagini.quotidiano.net/?h=391&url=http://p1014p.quotidiano.net:80/polopoly_fs/1.1371935.1630087164!/httpImage/image.jpg_gen/derivatives/widescreen/image.jpg&w=700",
    "publishedAt": "2022-04-10T17:32:35Z",
    "source": {
      "name": "D1SoftballNews.com",
      "url": "https://d1softballnews.com"
    }
  },
  {
"title": "Health insurance policy: Important terms to know",
"description": "Almost everyone has heard the famous adage ‘Health is Wealth,’ and the last couple of years have shown us how much wisdom lies in this age-old saying. Today, having a health insurance policy has become a necessity to ensure that we are well covered in case of any health-related exigency. However, before you buy a health coverage you must understand a few key terms related to",
"content": "Almost everyone has heard the famous adage ‘Health is Wealth,’ and the last couple of years have shown us how much wisdom lies in this age-old saying. Today, having a health insurance policy has become a necessity to ensure that we are well covered i... [4385 chars]",
"url": "https://www.deccanherald.com/business/business-news/health-insurance-policy-important-terms-to-know-1099510.html",
"image": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/04/10/file79vadh1tvc158anznrs-1099510-1649614609.jpg",
"publishedAt": "2022-04-10T22:12:01Z",
"source": {
"name": "Deccan Herald",
"url": "https://www.deccanherald.com"
}
},
  {
    "title": "How zero-sugar food impairs liver's ability to detoxify",
    "description": "Intake of zero-sugar food and beverages like yoghurt and diet soda may not be good for health as projected as they can impair your liver's ability to flush out toxins",
    "content": "How zero-sugar food impairs liver’s ability to detoxify\nBy IANS Published: Updated On - 09:16 PM, Sun - 10 April 22\nNew York: Intake of zero-sugar food and beverages like yoghurt and diet soda may not be good for health as projected as they can impai... [2568 chars]",
    "url": "https://telanganatoday.com/how-zero-sugar-food-impairs-livers-ability-to-detoxify",
    "image": "https://telanganatoday.com/wp-content/uploads/2022/04/liver-27.jpg",
    "publishedAt": "2022-04-10T15:42:08Z",
    "source": {
      "name": "Telangana Today",
      "url": "https://telanganatoday.com"
    }
  },
  {
    "title": "The BA.2 variant is spreading. Do you need to worry?",
    "description": "Keep watch on these numbers to know when—or if—you should take extra Covid-19 precautions",
    "content": "You’re going to the movies and eating indoors. Your kid stopped wearing a mask to school; you no longer wear one to work. After two years of Covid precautions, you finally feel normal again. Well, mostly.\nBA.2—a subvariant of the Omicron variant that... [5775 chars]",
    "url": "https://www.livemint.com/science/health/the-ba-2-variant-is-spreading-do-you-need-to-worry-11649601423870.html",
    "image": "https://images.livemint.com/img/2022/04/10/600x338/FILES-US-HEALTH-VIRUS-VACCINE-0_1649601989451_1649602061076.jpg",
    "publishedAt": "2022-04-10T15:38:05Z",
    "source": {
      "name": "Mint",
      "url": "https://www.livemint.com"
    }
  },
  {
    "title": "Exercise can lower risk of getting bowel cancer: Study",
    "description": "London: Exercise can lower your risk of getting bowel cancer and slow the growth of tumours, according to a recent study. The research was published in",
    "content": "London: Exercise can lower your risk of getting bowel cancer and slow the growth of tumours, according to a recent study.\nThe research was published in the journal, ‘International Journal of Cancer’.\nIt has been shown that physical activity causes th... [3881 chars]",
    "url": "https://www.siasat.com/exercise-can-lower-risk-of-getting-bowel-cancer-study-2306347/",
    "image": "https://cdn.siasat.com/wp-content/uploads/2021/11/exercise-_nov27.jpg",
    "publishedAt": "2022-04-10T15:28:00Z",
    "source": {
      "name": "The Siasat Daily",
      "url": "https://www.siasat.com"
    }
  },
  {
    "title": "Researchers reverse ageing in human cells by 30 years",
    "description": "UK researchers have developed a method to 'time jump' human skin cells by 30 years, turning back the ageing clock for cells without losing their specialised function",
    "content": "London: UK researchers have developed a method to ‘time jump’ human skin cells by 30 years, turning back the ageing clock for cells without losing their specialised function.\nThe team from the Babraham Institute at University of Cambridge has been ab... [2779 chars]",
    "url": "https://sambadenglish.com/researchers-reverse-ageing-in-human-cells-by-30-years/",
    "image": "https://sambadenglish.com/wp-content/uploads/2022/04/cell-research.jpg",
    "publishedAt": "2022-04-10T14:21:11Z",
    "source": {
      "name": "Sambad English",
      "url": "https://sambadenglish.com"
    }
  }
]