[
  {
    "title": "Does COVID-19 vaccination benefit those with prior SARS-CoV-2 infection?",
    "description": "Researchers evaluate the effectiveness of four COVID-19 vaccines against symptomatic infection, hospitalization, and death in convalescent individuals.",
    "content": "Since the onset of the coronavirus disease 2019 (COVID-19) pandemic, which is caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), over 493 million confirmed cases have been reported.\nScientists have developed several vaccines to c... [5908 chars]",
    "url": "https://www.news-medical.net/news/20220405/Does-COVID-19-vaccination-benefit-those-with-prior-SARS-CoV-2-infection.aspx",
    "image": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709818_16491859871835304.jpg",
    "publishedAt": "2022-04-06T00:52:00Z",
    "source": {
      "name": "News-Medical.Net",
      "url": "https://www.news-medical.net"
    }
  },
  {
    "title": "Mixed Bag for Fourth Dose of Pfizer Vaccine vs Omicron",
    "description": "Real-world data show less infection and severity, but long-term benefit less clear",
    "content": "Rates of confirmed Omicron-related COVID infection and severe disease were lower after a fourth dose of the Pfizer-BioNTech vaccine, according to real-world data from Israel, although protection against confirmed infection seemed short-lived.\nAmong a... [3870 chars]",
    "url": "https://www.medpagetoday.com/infectiousdisease/covid19vaccine/98061",
    "image": "https://assets.medpagetoday.net/media/images/98xxx/98061.jpg",
    "publishedAt": "2022-04-05T21:46:49Z",
    "source": {
      "name": "Medpage Today",
      "url": "https://www.medpagetoday.com"
    }
  },
  {
    "title": "High cholesterol: Plant sterols can help lower levels - food sources",
    "description": "DIET interventions can be a simple way to slash high cholesterol levels. 'It is vital for people to manage their cholesterol in order to lower cardiovascular risk,' said nutritionist Rob Hobson. One way to see your levels fall by as much as 10 percent is by adding plant sterols to your diet.",
    "content": "We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. More info\nHigh cholesterol descr... [943 chars]",
    "url": "https://www.express.co.uk/life-style/health/1591712/high-cholesterol-diet-plant-sterols-yoghurt-butter-dairy-drink-lower-levels",
    "image": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1591712.jpg",
    "publishedAt": "2022-04-05T17:54:00Z",
    "source": {
      "name": "Express",
      "url": "https://www.express.co.uk"
    }
  },
  {
    "title": "Combining your eggs correctly: 4 best omelette combinations that can help you shed kilos speedily",
    "description": "These high-quality protein can make you feel satiated and at the same time provide other essential nutrients, required by the body to carry out vital internal functions.",
    "content": "Eggs are a go-to source of protein for all the non-vegetarians trying to shed kilos and build muscles. Nutritious, healthy and cheap, eggs are easy to experiment with and can be turned into a delicious recipe within a few minutes. These high-quality ... [453 chars]",
    "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/combining-your-eggs-correctly-4-best-omelette-combinations-that-can-help-you-shed-kilos-speedily/photostory/90669536.cms",
    "image": "https://static.toiimg.com/photo/90669696.cms",
    "publishedAt": "2022-04-05T16:30:00Z",
    "source": {
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com"
    }
  },
  {
    "title": "Study explores long-lasting psychological implications of long COVID",
    "description": "Researchers evaluated the long-standing psychological manifestations of long coronavirus disease (long COVID).",
    "content": "In a recent study posted to the medRxiv* preprint server, researchers evaluated the long-standing psychological manifestations of long coronavirus disease (long COVID).\nBackground\nThe persistence of severe acute respiratory syndrome coronavirus 2 (SA... [5601 chars]",
    "url": "https://www.news-medical.net/news/20220405/Study-explores-long-lasting-psychological-implications-of-long-COVID.aspx",
    "image": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709790_16491751813599148.jpg",
    "publishedAt": "2022-04-05T16:22:00Z",
    "source": {
      "name": "News-Medical.Net",
      "url": "https://www.news-medical.net"
    }
  },
  {
    "title": "Ukraine’s health crisis: ‘I don’t know what will kill me first - HIV or bombs’",
    "description": "HIV medication is running thin in Ukraine, which has one of the highest infection rates in Europe",
    "content": "In early February, 29-year-old Anastaysia, from the town of Nemishaieve, west of Kyiv, was diagnosed with HIV.\nShe was terrified, she told The Telegraph, and unsure what the diagnosis meant for her future. Two weeks later, Russia invaded Ukraine.\n“I ... [563 chars]",
    "url": "https://www.telegraph.co.uk/global-health/science-and-disease/ukraines-hiv-crisis-dont-know-will-kill-first-hiv-bombs/",
    "image": "https://www.telegraph.co.uk/content/dam/global-health/2022/04/05/TELEMMGLPICT000290298717_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=logo-overlay",
    "publishedAt": "2022-04-05T15:18:00Z",
    "source": {
      "name": "The Telegraph",
      "url": "https://www.telegraph.co.uk"
    }
  },
  {
    "title": "This is SERIOUS! Study reveals COVID can have long-term impacts on brain",
    "description": "COVID19: Neurological complications are often among the first symptoms of SARS-CoV-2 infection and can be the most severe and persistent. They also affect people indiscriminately -- all ages, with and without comorbidities, and with varying degrees of disease severity.",
    "content": "Follow us on Image Source : FREEPIK COVID\nA recent study has found that people infected with the SARS-CoV-2 virus displayed signs of severe brain inflammation and injury consistent with a reduction in blood or oxygen flow into the brain, neuron damag... [1770 chars]",
    "url": "https://www.indiatvnews.com/health/this-is-serious-study-reveals-covid-can-have-long-term-impacts-on-brain-2022-04-05-767915",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/04/pjimage-2022-04-05t202917-1649170761.jpg",
    "publishedAt": "2022-04-05T14:59:42Z",
    "source": {
      "name": "India TV News",
      "url": "https://www.indiatvnews.com"
    }
  },
  {
    "title": "Omicron variant less severe than Delta for children younger than 5 years: Study",
    "description": "The finding led by researchers at the Case Western Reserve University in the US show that the Omicron variant is 6-8 times more infectious than the Delta variant.",
    "content": "Children younger than five years who are infected with Omicron have less risk of severe health outcomes than those infected with the Delta variant of coronavirus, according to a study.\nThe research, published in the journal JAMA Pediatrics, is the fi... [2789 chars]",
    "url": "https://indianexpress.com/article/parenting/health-fitness/omicron-variant-less-severe-than-delta-for-children-younger-than-5-years-study-7852044/",
    "image": "https://images.indianexpress.com/2022/04/GettyImages-children-Omicron-Covid-1200.jpg",
    "publishedAt": "2022-04-05T14:22:58Z",
    "source": {
      "name": "The Indian Express",
      "url": "https://indianexpress.com"
    }
  },
  {
    "title": "Study reveals how Covid can lead to long-term pain",
    "description": "A team of researchers has provided important insights into how SARS-CoV-2 -- the virus responsible for Covid-19 -- can lead to long-term pain.",
    "content": "New York: A team of researchers has provided important insights into how SARS-CoV-2 -- the virus responsible for Covid-19 -- can lead to long-term pain.\nUsing a hamster model of SARS-CoV-2 infection, the research team found that the infection left a ... [1946 chars]",
    "url": "https://www.thehansindia.com/life-style/health/study-reveals-how-covid-can-lead-to-long-term-pain-736673",
    "image": "https://assets.thehansindia.com/h-upload/2022/04/05/1285307-covid.jpg",
    "publishedAt": "2022-04-05T13:39:21Z",
    "source": {
      "name": "The Hans India",
      "url": "https://www.thehansindia.com"
    }
  },
  {
    "title": "Being Sick for a Long Time Affects Your Hair Quality. Know How To Nurture Them",
    "description": "Biotin also known as Vitamin B-7 provides nourishment to white blood cells (WBC) and the scalp.",
    "content": "We opt for various measures to ensure that our hair remains strong, dark, and dense. However, our diet and health conditions also affect the strength and growth of our hair. The Covid-19 pandemic has also led to an increase in the issue of Hairfall.\n... [2454 chars]",
    "url": "https://www.news18.com/news/lifestyle/being-sick-for-a-long-time-affects-your-hair-quality-know-how-to-nurture-them-4945298.html",
    "image": "https://images.news18.com/ibnlive/uploads/2022/04/untitled-design-39-1-164916575116x9.png",
    "publishedAt": "2022-04-05T13:37:00Z",
    "source": {
      "name": "News18",
      "url": "https://www.news18.com"
    }
  }
]